const chapters = [
    {
        "name": "ゼロフィールド",
        "stages": [
            {
                "stage": "はじまりの世界",
                "energy": 200,
                "enemies": ["怒りのブラッゴリ", "メタフィリバスター", "超古獣マガモジョー", "超天獣ラジャコング", "超翼獣ピヨルーツ", "超鳥獣アヒルジョー"]
            },
        ]
    },
    {
        "name": "時空の最果て",
        "stages": [
            {
                "stage": "宇宙の法則が乱れた",
                "energy": 200,
                "enemies": ["天使ガブリエル", "デビルワン", "ミスターエンジェル", "天使ゴンザレス", "シスターデビル", "大天使チビネル", "ヘルゴリラー", "神さま"]
            },
            {
                "stage": "ゼロの地平線",
                "energy": 210,
                "enemies": ["クマ先生","野生のわんこ","殺意のわんこ","クマンチュー","クマンケン","アックマ閣下","ごん兵衛"
                ]
            },
            {
                "stage": "夕焼けのハドロン",
                "energy": 200,
                "enemies": ["ワーニック", "ワニボン", "デカメガネル", "テバムラサキホネツバメ", "超爆獣アリアント", "イノヴァルカン", "アルパッカ"]
            },
            {
                "stage": "猫対性理論",
                "energy": 200,
                "enemies": ["イングリッス", "古代わんこ", "ハニワンワン", "超町長", "ホワイトサイクロン"]
            },
            {
                "stage": "陽子と中性子と悦子",
                "energy": 190,
                "enemies": ["例のヤツ", "メタルカバちゃん", "メタルわんこ", "野生のわんこ", "超甲獣シザーレックス"]
            },
            {
                "stage": "ニュートリノ異雪原",
                "energy": 260,
                "enemies": ["ちびわんこ", "オオウサ銀", "赤毛のにょろ", "リッスントゥミー", "ミニホワイトサイクロン", "般若我王"]
            },
        ]
    },
    {
        "name": "バリチッチ盆地",
        "stages": [
            {
                "stage": "グリ高原",
                "energy": 200,
                "enemies": ["ワーニネーター", "殺意のわんこ", "エリートエイリワン", "オールドリー", "ダチョウ同好会"]
            },
            {
                "stage": "こっくり散歩道",
                "energy": 200,
                "enemies": ["イングリッス", "天使ガブリエル", "ツバメンズ", "野生のわんこ", "はぐれたヤツ", "ワニック", "亡者デブウ"]
            },
            {
                "stage": "にらめっ湖のほとり",
                "energy": 200,
                "enemies": ["ウサ銀", "ガガガガ", "ゴリさん", "怒りのブラッゴリ", "オオウサ銀", "レッド・エナG", "古兵器マンボロス", "真レジェンドブンブン"]
            },
            {
                "stage": "泥まみれ渓流",
                "energy": 210,
                "enemies": ["ワーニック", "ゴマサーマン", "シャドウボクサー", "エリザベス56世", "デビルワン", "デヴィル夫人", "アックマ閣下", "デカメガネル", "ダテメガネル", "反逆のヴァルキリー"]
            },
            {
                "stage": "ケン・ケンパ峰",
                "energy": 190,
                "enemies": ["タッキー", "例のヤツ", "ミニホワイトサイクロン", "一角くん", "赤毛のにょろ", "メェメェ", "フルぼっこ"]
            },
            {
                "stage": "おしくらまん樹林",
                "energy": 260,
                "enemies": ["例のヤツ", "オオウサ銀", "シスターデビル", "リッスントゥミー", "デヴィル夫人", "超舌獣ラングマスター", "超象獣パパオウ"]
            },
        ]
    },
    {
        "name": "ウルルブ島滞在記",
        "stages": [
            {
                "stage": "エキストラ原住民",
                "energy": 300,
                "enemies": ["わんこ", "にょろ", "例のヤツ", "聖天ゴクラッコ", "ジャッキー・ペン", "カバちゃん", "カ・ンガリュ", "ダチョウ同好会", "古代わんこ", "ウルフとウルルン"]
            },
            {
                "stage": "野ざらしホームステイ",
                "energy": 310,
                "enemies": ["エリートエイリワン", "殺意のわんこ", "スター・ペン", "ブラッコ", "ブラッゴリ", "ゲコック", "ミニスターサイクロン", "ウルフとウルルン"]
            },
            {
                "stage": "目撃!AI伝統漁",
                "energy": 300,
                "enemies": ["ワニック", "リッスントゥミー", "天使ガブリエル", "天使ゴンザレス", "聖天ゴクラッコ", "イルカ娘", "天使ブッタ", "ウルフとウルルン"]
            },
            {
                "stage": "いけにえ体験学習",
                "energy": 350,
                "enemies": ["ウルフとウルルン", "セレブ", "古代わんこ", "謎仮面のウララー", "イングリッス"]
            },
        ]
    },
    {
        "name": "新世界アリ＝エヘン",
        "stages": [
            {
                "stage": "おもろ入り江",
                "energy": 150,
                "enemies": ["セレブ", "プドール夫人", "デヴィル夫人", "ヘルゴリラー", "教授"]
            },
            {
                "stage": "虎穴に入らずんば",
                "energy": 160,
                "enemies": ["一角くん","マナブくん","ナカイくん","コライノくん","大夢くん","フグ太くん"]
            },
            {
                "stage": "オマエ・ナンヤ島",
                "energy": 150,
                "enemies": ["殺意のわんこ", "カベわんこ", "タッちゃん", "天使ドーヴエル", "エンジェルサイクロン"]
            },
            {
                "stage": "チャウチャウチャ運河",
                "energy": 160,
                "enemies": ["ワニック", "超魚獣アンガブル", "超棘獣ナマケモルガ", "超豚獣ピーギィ", "ツバメンズ", "ブタヤロウ"]
            },
            {
                "stage": "どうなっとん堀",
                "energy": 150,
                "enemies": ["リッスントゥミー","ブラッゴリ","怒りのブラッゴリ","イングリッス","マーさん","ヨキカナ"]
            },
            {
                "stage": "いてもうたロード",
                "energy": 160,
                "enemies": ["烈波砲", "わんこ", "大天使チビネル", "ちびぶんぶん", "イノエンジェル"]
            },
            {
                "stage": "ぼちぼち都心",
                "energy": 150,
                "enemies": ["ウサ銀", "オオウサ銀", "ブラッコ", "フルぼっこ", "聖天ゴクラッコ", "森の蜜子"]
            },
            {
                "stage": "シランケ洞",
                "energy": 200,
                "enemies": ["ハニワンワン", "ちびわんこ", "ド鳩・サブ・レー", "だっふんど", "例のヤツ", "バトルコアラッキョ", "超古獣マガモジョー"]
            },
        ]
    },
    {
        "name": "われら海の猫",
        "stages": [
            {
                "stage": "大潮の渚",
                "energy": 250,
                "enemies": ["カバちゃん", "天使カバちゃん", "カバタリアン", "カーバチャン", "超メタルカバちゃん", "カルピンチョ", "ミニホワイトサイクロン", "メタルコアラッキョ"]
            },
            {
                "stage": "グレートバリアフリー",
                "energy": 230,
                "enemies": ["チンアナ5兄弟", "古代わんこ", "メガメェメェ", "魔我王", "アックマ閣下"]
            },
            {
                "stage": "ふかひれ出没海域",
                "energy": 220,
                "enemies": ["はぐれたヤツ", "デヴィル夫人", "ハイ・エナジー", "イカ天"]
            },
            {
                "stage": "海底2マイル",
                "energy": 200,
                "enemies": ["にょろ", "野生のわんこ", "アヒルンルン", "ガガガガ", "赤羅我王", "松 黒蔵", "超竜獣オウルハズク"]
            },
            {
                "stage": "水中洞窟の生態系",
                "energy": 100,
                "enemies": ["ゴマさま", "ブラックマ", "メガメェメェ", "ギルティ・ペン", "レディ・ガ"]
            },
            {
                "stage": "深海限界の先に",
                "energy": 260,
                "enemies": ["リッスントゥミー", "エイリワン", "サイバーX", "破壊生物クオリネン", "天使ガブリエル", "断罪天使クオリネル", "聖天ゴクラッコ"]
            },
        ]
    },
    {
        "name": "対極にある真実",
        "stages": [
            {
                "stage": "猛る草原の巨象",
                "energy": 200,
                "enemies": ["ウサ銀", "まゆげどり", "リッスントゥミー", "パオンモス", "聖天ゴクラッコ", "ミッドナイトナカイ", "ウリボーイ"]
            },
            {
                "stage": "静かなる草原の虚像",
                "energy": 200,
                "enemies": ["ウサ銀", "まゆげどり", "リッスントゥミー", "スペースサイクロン", "聖天ゴクラッコ", "ミッドナイトナカイ", "ウリボーイ"]
            },
            {
                "stage": "顔窟王",
                "energy": 210,
                "enemies": ["ちびわんこ", "ゴマサーマン", "超爆獣アリアント", "古我王", "ミニエンジェルサイクロン"]
            },
            {
                "stage": "獣窟王",
                "energy": 210,
                "enemies": ["ちびわんこ", "ゴマサーマン", "超爆獣アリアント", "超棘獣ナマケモルガ", "ミニエンジェルサイクロン"]
            },
            {
                "stage": "砂礫を牛耳る恵まれし者",
                "energy": 220,
                "enemies": ["例のヤツ", "メガメェメェ", "シャドウボクサー", "デビルカツヤ", "チワワン伯爵"]
            },
            {
                "stage": "砂礫を牛耳る不遇な者",
                "energy": 220,
                "enemies": ["例のヤツ", "メガメェメェ", "シャドウボクサー", "デビルカツヤ", "超新星テッサー", "フグ太くん"]
            },
        ]
    },
    {
        "name": "デシリットル湾の魔物",
        "stages": [
            {
                "stage": "解を求めて三千里",
                "energy": 200,
                "enemies": ["デヴィル夫人", "インフェルにょろ", "ギルティ・ペン", "マデューさん", "ミニエンジェルサイクロン"]
            },
            {
                "stage": "ピタゴラ水源",
                "energy": 210,
                "enemies": ["殺意のわんこ", "ヘルゴリラー", "ブラックサイクロン", "キョセーヌ"]
            },
            {
                "stage": "イチタスニハ山",
                "energy": 200,
                "enemies": ["ガガガガ", "ちびぶんぶん", "ミニホワイトサイクロン", "超町長", "ぶんぶん先生", "古兵器マンボロス"]
            },
            {
                "stage": "サインコサイン炭鉱",
                "energy": 220,
                "enemies": ["オオさん", "例のヤツ", "ケルベローズ", "スリラーズ", "はぐれたヤツ", "レインボークマトーク"]
            },
            {
                "stage": "二等辺三角渓",
                "energy": 200,
                "enemies": ["ウルトラメェメェ", "天使ガブリエル", "ヤドカリー", "マンボーグ鈴木", "天使ゴンザレス", "天使ブッタ", "ミニエンジェルサイクロン"]
            },
            {
                "stage": "遥かなる点P",
                "energy": 230,
                "enemies": ["ワニック", "ドリュウ", "メガメェメェ", "オオウサ銀", "ユメミちゃん"]
            },
        ]
    },
    {
        "name": "枯れた思考の庭",
        "stages": [
            {
                "stage": "無学なソフィスト",
                "energy": 100,
                "enemies": ["タッキー", "メタルカオル君", "チキランラン", "柏餅2.0"]
            },
            {
                "stage": "反証だらけ半生",
                "energy": 200,
                "enemies": ["赤毛のにょろ", "エリザベス2世", "ジョン・レオン", "ごん兵衛", "ヒウマ", "聖天ゴクラッコ"]
            },
            {
                "stage": "イロニーの森",
                "energy": 210,
                "enemies": ["イノシャシ", "イノエンジェル", "ゲコック", "ケロ助"]
            },
            {
                "stage": "あてなき押し問答",
                "energy": 220,
                "enemies": ["ルーパールーパー", "キャベロン", "デスコアラッキョ", "レッドサイクロン"]
            },
            {
                "stage": "毒言に満ちた荒原",
                "energy": 230,
                "enemies": ["テバムラサキホネツバメ", "プドール夫人", "古代わんこ", "墓手太郎", "オールドリー"]
            },
            {
                "stage": "よき生への執着",
                "energy": 300,
                "enemies": ["殺意のわんこ", "論の賢者ソラクティス"]
            },
        ]
    },
    {
        "name": "異空行路の先に",
        "stages": [
            {
                "stage": "自由への上陸地",
                "energy": 200,
                "enemies": ["名賢わんこ", "ギャラクシーニャンダム", "よっちゃん", "ダディ"]
            },
            {
                "stage": "大いなる小さき一歩",
                "energy": 210,
                "enemies": ["ヒカル", "シスターデビル", "デビルワン", "悪魔ベヒモッス", "デヴィル夫人", "名賢わんこ", "ミッドナイトナカイ"]
            },
            {
                "stage": "ビッグバーガーガーデン",
                "energy": 210,
                "enemies": ["ハハパオン", "スター・ペン", "カヲルさん", "デカメガネル", "キャプテン・モグー", "大夢くん", "パラサイトブンブン"]
            },
            {
                "stage": "大草原の小さな入り江",
                "energy": 210,
                "enemies": ["名賢わんこ", "師匠", "カ・ンガリュ", "こぶへい", "巨匠", "ナカイくん"]
            },
            {
                "stage": "バブリー感ドリーム",
                "energy": 180,
                "enemies": ["ミニエンジェルサイクロン", "ミニホワイトサイクロン", "ミニアンデッドサイクロン", "ミニスターサイクロン"]
            },
            {
                "stage": "グレートプレーリー港",
                "energy": 250,
                "enemies": ["名賢わんこ", "聖天ゴクラッコ", "天使ドーヴエル", "天使メガミエル"]
            },
        ]
    },
    {
        "name": "イトコンバレー",
        "stages": [
            {
                "stage": "ぐるぐる自動車道",
                "energy": 180,
                "enemies": ["メタルゴマさま", "ワーニネーター", "天使ガブリエル", "天使メガミエル", "天使ヒオコエル", "ミスターエンジェル"]
            },
            {
                "stage": "インスタント写真館",
                "energy": 250,
                "enemies": ["ツバメンズ", "名賢わんこ", "ドヴェルダーク", "セレブ", "天使メガミエル"]
            },
            {
                "stage": "メタリックメタバース",
                "energy": 180,
                "enemies": ["メタルサイボーグ", "ヒツギイヌ", "メタルわんこ", "ジャッキー・ペンZ", "トロリンチョ", "純金倶楽部", "スカルボクサー"]
            },
            {
                "stage": "パイナップル商事",
                "energy": 250,
                "enemies": ["イングリッス", "インフェルにょろ", "ハニワンワン", "ギルティ・ペン", "真レジェンドブンブン", "ヘルゴリラー"]
            },
            {
                "stage": "マイクロ高層ビル",
                "energy": 150,
                "enemies": ["メタルサイクロン", "フグ太くん"]
            },
            {
                "stage": "青き鳥の幻影",
                "energy": 250,
                "enemies": ["名賢わんこ", "メガメェメェ", "怒りのブラッゴリ", "ドヴェルダーク", "タッちゃん"]
            },
        ]
    },
    {
        "name": "カルメ桃源郷",
        "stages": [
            {
                "stage": "きなこ墓地",
                "energy": 200,
                "enemies": ["ゾンビワン", "ウサ銀", "教授", "墓手花子", "ゴリ・ンジュ"]
            },
            {
                "stage": "トンガリ湖畔",
                "energy": 210,
                "enemies": ["名賢わんこ", "ブラッゴリ", "はぐれたヤツ", "コライノくん", "ドヴェルダーク"]
            },
            {
                "stage": "降り注ぐねりあめ",
                "energy": 200,
                "enemies": ["わんこの城", "例のヤツ", "スリラーズ", "ヒツギイヌ", "メガメェメェ", "シノシシ", "クマンケン"]
            },
            {
                "stage": "ヨーグ列島",
                "energy": 220,
                "enemies": ["リッスントゥミー", "ドクターK.O.", "マデューさん", "アックマ閣下"]
            },
            {
                "stage": "かたぬき遺跡",
                "energy": 200,
                "enemies": ["烈波砲", "カオル君", "ワニック", "にょろろん", "トンシー", "ブチゴマさま"]
            },
            {
                "stage": "パチパチワンダーランド",
                "energy": 230,
                "enemies": ["ワーニック", "パワハラッコ部長", "スペースマンボルグ", "名賢わんこ", "ドクターK.O."]
            },
        ]
    },
    {
        "name": "隠されしモルモ島",
        "stages": [
            {
                "stage": "ヨード液シー",
                "energy": 200,
                "enemies": ["殺意のわんこ", "ブラッコ", "テク・ノロ爺", "イルカ娘"]
            },
            {
                "stage": "薬品くさい牢屋",
                "energy": 220,
                "enemies": ["古代砲", "にょろ", "ワニック", "イングリッス", "ドクターK.O.", "メガメェメェ", "サイバーX", "ちびぶんぶん"]
            },
            {
                "stage": "蟲毒が生む孤独",
                "energy": 210,
                "enemies": ["例のヤツ", "リッスントゥミー", "天使ガブリエル", "名賢わんこ", "ドヴェルダーク", "聖天ゴクラッコ"]
            },
            {
                "stage": "ナンセンス細胞変異",
                "energy": 200,
                "enemies": ["ド鳩・サブ・レー", "名賢わんこ", "ウリボーイ", "テク・ノロ爺", "バトルコアラッキョ"]
            },
            {
                "stage": "うっかり劇薬",
                "energy": 230,
                "enemies": ["名賢わんこ", "ウサ銀", "天使ゴンザレス", "ジョン・レオン", "天使メガミエル", "デビルカツヤ", "ドクターK.O."]
            },
            {
                "stage": "ハートフル生体兵器",
                "energy": 200,
                "enemies": ["名賢わんこ", "デヴィル夫人", "テク・ノロ爺", "亡者デブウ", "グレゴリー将軍"]
            },
        ]
    },
    {
        "name": "行楽地デラ・コスパ",
        "stages": [
            {
                "stage": "プレハブ大聖堂",
                "energy": 230,
                "enemies": ["ツバサターン", "まゆげどり", "キョセーヌ", "ダチョウ同好会"]
            },
            {
                "stage": "お昼寝アクティビティ",
                "energy": 220,
                "enemies": ["赤毛のにょろ", "ブタヤロウ", "悪の帝王ニャンダム", "テク・ノロ爺", "ドクターK.O."]
            },
            {
                "stage": "雑草庭園",
                "energy": 230,
                "enemies": ["名賢わんこ", "天使カバちゃん", "ツバサターン", "天使スレイプニール", "イカ天", "天使メガミエル"]
            },
            {
                "stage": "短距離パレード",
                "energy": 180,
                "enemies": ["スカルボクサー", "カ・ンガリュ", "シャドウボクサー", "ハサミーマン", "ドクターK.O."]
            },
            {
                "stage": "プライベートないビーチ",
                "energy": 200,
                "enemies": ["ワーニネーター", "メタルカバちゃん", "超メタルカバちゃん", "ドヴェルダーク", "メタルゴマさま"]
            },
            {
                "stage": "あこぎな出国料",
                "energy": 200,
                "enemies": ["ツバサターン", "テバムラサキホネツバメ", "シスターデビル", "ハリケーンサイクロン", "アヒルンルン"]
            },
        ]
    },
    {
        "name": "ゆらぎの禁制区域",
        "stages": [
            {
                "stage": "フレミングT字海路",
                "energy": 200,
                "enemies": ["カバタリアン", "名賢わんこ", "トンシー", "ダ・チョー老", "ナマルケモルル"]
            },
            {
                "stage": "反物質ジャングル",
                "energy": 250,
                "enemies": ["殺意のわんこ", "カルピンチョ", "天使メガミエル", "ツバサターン", "テク・ノロ爺"]
            },
            {
                "stage": "力なきゼロ磁場",
                "energy": 250,
                "enemies": ["名賢わんこ", "デビルワン", "ツバサターン", "ドヴェルダーク", "魔我王"]
            },
            {
                "stage": "エントロピートロピカル",
                "energy": 160,
                "enemies": ["トロリンチョ", "ダ・チョー老"]
            },
            {
                "stage": "オイラーノ群島",
                "energy": 250,
                "enemies": ["ウサ銀", "ケルベローズ", "ドクターK.O.", "ごん兵衛", "デスコアラッキョ"]
            },
            {
                "stage": "天意に背く落果",
                "energy": 150,
                "enemies": ["名賢わんこ", "プドール夫人", "チワワン伯爵", "ダ・チョー老"]
            },
        ]
    },
    {
        "name": "豪華客船ハイパニック",
        "stages": [
            {
                "stage": "素性不明な一日船長",
                "energy": 180,
                "enemies": ["天使ガブリエル", "チキランラン", "ツバサターン", "ツバメンズ", "メガメェメェ", "フグ太くん"]
            },
            {
                "stage": "密室スイート客室",
                "energy": 200,
                "enemies": ["ゾンビワン", "ウルトラメェメェ", "プドール夫人", "エリザベス56世", "カバタリアン", "ダ・チョー老"]
            },
            {
                "stage": "求婚前夜の凪",
                "energy": 250,
                "enemies": ["イングリッス", "天使メガミエル", "大天使チビネル", "オールドリー", "古我王"]
            },
            {
                "stage": "オートマチック危機回避",
                "energy": 220,
                "enemies": ["ちびわんこ", "名賢わんこ", "ダディ", "天使ドーヴエル", "ドヴェルダーク", "破壊生物クオリネン"]
            },
            {
                "stage": "隊列乱すパイレーツ",
                "energy": 180,
                "enemies": ["ヒツギイヌ", "ドクターK.O.", "テク・ノロ爺", "セレブ", "ダ・チョー老"]
            },
            {
                "stage": "ノープロブレム帰港",
                "energy": 230,
                "enemies": ["名賢わんこ", "ツバサターン", "聖天ゴクラッコ", "ミニエンジェルサイクロン", "アックマ閣下", "断罪天使クオリネル"]
            },
        ]
    },
    {
        "name": "アンガード大魔宮",
        "stages": [
            {
                "stage": "万人通す番人",
                "energy": 200,
                "enemies": ["シスターデビル", "名賢わんこ", "ふくろう博士", "ブラックブンブン", "悪魔ベヒモッス"]
            },
            {
                "stage": "やわらかいワナ",
                "energy": 100,
                "enemies": ["クマンチュー", "ミニホワイトサイクロン", "古兵器マンボロス", "ミッドナイトナカイ", "天使ブッタ"]
            },
            {
                "stage": "オートウォーク迷路",
                "energy": 240,
                "enemies": ["メタルサイボーグ", "超メタルカバちゃん", "ふくろう博士", "ツバサターン"]
            },
            {
                "stage": "ほがらか邪教信者",
                "energy": 230,
                "enemies": ["メガメェメェ", "デヴィル夫人", "ギルティ・ペン", "天使メガミエル", "イノワール"]
            },
            {
                "stage": "ライトアップ隠し扉",
                "energy": 240,
                "enemies": ["テク・ノロ爺", "ハイ・エナジー", "レッド・エナG"]
            },
            {
                "stage": "まる出し宝物庫",
                "energy": 250,
                "enemies": ["名賢わんこ", "ドクターK.O.", "ふくろう博士", "般若我王"]
            },
        ]
    },
    {
        "name": "遊園森林ガングール",
        "stages": [
            {
                "stage": "竹とんぼ群生地",
                "energy": 200,
                "enemies": ["名賢わんこ", "天使ガブリエル", "天使ゴンザレス", "ジョン・レオン", "クロサワ監督", "シャチコ"]
            },
            {
                "stage": "ヨーヨー広葉樹",
                "energy": 240,
                "enemies": ["にょろろん", "古代わんこ", "だっふんど", "ふくろう博士", "アンデッドサイクロン", "シャチコ"]
            },
            {
                "stage": "底なしのおはじき沼",
                "energy": 230,
                "enemies": ["はぐれたヤツ", "エリートエイリワン", "怒りのブラッゴリ", "テク・ノロ爺", "ヒウマ", "ふくろう博士"]
            },
            {
                "stage": "ピロピロ笛水草",
                "energy": 240,
                "enemies": ["名賢わんこ", "メガメェメェ", "ドヴェルダーク", "シャチコ", "聖天ゴクラッコ"]
            },
            {
                "stage": "ぶつけゴマ丘陵",
                "energy": 100,
                "enemies": ["ルーパールーパー", "ブラックマ"]
            },
            {
                "stage": "めんこい大瀑布",
                "energy": 250,
                "enemies": ["ヒツギイヌ", "スリラーズ", "ガガガガ", "名賢わんこ", "ナカイくん", "ヒカル", "ダ・チョー老"]
            },
        ]
    },
    {
        "name": "ニュータウン海淵",
        "stages": [
            {
                "stage": "漂流バスターミナル",
                "energy": 200,
                "enemies": ["メタルわんこ", "メタルゴマさま", "カ・ンガリュ", "ダディ", "イルカ娘", "ハイ・エナジー"]
            },
            {
                "stage": "サンゴ住宅団地",
                "energy": 200,
                "enemies": ["エイリワン", "ゴマサーマン", "ハサミーマン", "天使ドーヴエル", "マナブくん", "レッド・エナG"]
            },
            {
                "stage": "沈没船リノベーション宿",
                "energy": 200,
                "enemies": ["名賢わんこ", "ゴマさま", "ドクターK.O.", "ドヴェルダーク", "シャチコ", "テク・ノロ爺"]
            },
            {
                "stage": "イカスミュージアム",
                "energy": 220,
                "enemies": ["エリートエイリワン", "ツバメンズ", "まゆげどり", "デカメガネル", "ダチョウ同好会"]
            },
            {
                "stage": "わかめ緑地キャンプ場",
                "energy": 220,
                "enemies": ["古代わんこ", "テバムラサキホネツバメ", "まゆげどり", "ダテメガネル", "オールドリー"]
            },
            {
                "stage": "藻屑みはらし台",
                "energy": 220,
                "enemies": ["ゾンビワン", "ツバサターン", "ふくろう博士", "天使メガミエル", "ダ・チョー老"]
            },
        ]
    },
    {
        "name": "万物誘う心理の大渦",
        "stages": [
            {
                "stage": "終生の知的探求",
                "energy": 200,
                "enemies": ["名賢わんこ", "ふくろう博士", "マーさん", "天使メガミエル", "天使スレイプニール"]
            },
            {
                "stage": "ロンリー論理",
                "energy": 210,
                "enemies": ["ハニワンワン", "デビルワン", "デヴィル夫人", "ツバサターン", "パラサイトブンブン", "シャチコ", "コライノくん"]
            },
            {
                "stage": "落ちる果実の法則",
                "energy": 150,
                "enemies": ["わんこの城", "テク・ノロ爺", "教授"]
            },
            {
                "stage": "七色に分かたれる光",
                "energy": 200,
                "enemies": ["殺意のわんこ", "ちびわんこ", "ナカイくん", "ブラッコ", "クロサワ監督", "ウリボーイ", "タッちゃん"]
            },
            {
                "stage": "仮説不要説",
                "energy": 200,
                "enemies": ["ウルトラメェメェ", "ワニボン", "グレゴリー将軍", "スカルボクサー", "大夢くん", "墓手太郎", "赤羅我王"]
            },
            {
                "stage": "力を計り得ぬ者",
                "energy": 300,
                "enemies": ["リッスントゥミー", "理の賢者ニュトーン", "ミスターエンジェル", "ちびぶんぶん", "天使ゴンザレス"]
            },
        ]
    },
    {
        "name": "新たな時を刻む旅路",
        "stages": [
            {
                "stage": "タイマースター塔",
                "energy": 220,
                "enemies": ["リッスントゥミー", "ワーニック", "テッポー", "サイバーX", "ギャラクシーニャンダム"]
            },
            {
                "stage": "22時22分の観測者",
                "energy": 180,
                "enemies": ["メタルわんこ", "シャドウボクサー", "超メタルカバちゃん", "怒りのブラッゴリ", "ブラックブンブン", "メタルゴマさま"]
            },
            {
                "stage": "チクタク住宅地区",
                "energy": 210,
                "enemies": ["はぐれたヤツ", "ウサ銀", "レッド・エナG", "ドリュウ", "ヒウマ", "ジョン・レオン"]
            },
            {
                "stage": "手際の良い時間泥棒",
                "energy": 200,
                "enemies": ["真レジェンドブンブン", "パラサイトブンブン", "ブラックブンブン", "赤井ブン太郎", "ぶんぶん先生", "ちびぶんぶん", "古代わんこ", "セレブ"]
            },
            {
                "stage": "真っ黒クロック牢獄",
                "energy": 210,
                "enemies": ["イングリッス", "スター・ペン", "グレゴリー将軍", "コライノくん", "テク・ノロ爺", "古我王"]
            },
            {
                "stage": "長針と短針の密会",
                "energy": 240,
                "enemies": ["殺意のわんこ", "ツバサターン", "インフェルにょろ", "ギルティ・ペン", "アックマ閣下", "かわわっぱJr."]
            },
        ]
    },
    {
        "name": "甘味自然公園",
        "stages": [
            {
                "stage": "ザクザクッキー山脈",
                "energy": 200,
                "enemies": ["例のヤツ", "天使ガブリエル", "ジャッキー・ペン", "ぶんぶん先生", "エンジェ・ルース", "師匠"]
            },
            {
                "stage": "極寒クリーム雪原",
                "energy": 220,
                "enemies": ["天使ガブリエル", "エリートエイリワン", "天使カバちゃん", "プドール夫人", "天使ブッタ", "アンドロメ・ダ長官"]
            },
            {
                "stage": "ティラミス断崖",
                "energy": 210,
                "enemies": ["名賢わんこ", "イングリッス", "ミニエンジェルサイクロン", "天使メガミエル", "イカ天", "コライノくん", "シャチコ"]
            },
            {
                "stage": "忘れがたきタピ丘",
                "energy": 220,
                "enemies": ["殺意のわんこ", "ゾンビワン", "スリラーズ", "スカルボクサー", "クマンケン", "ドヴェルダーク"]
            },
            {
                "stage": "秘境ナタ・デ古道",
                "energy": 180,
                "enemies": ["ワーニネーター", "はぐれたヤツ", "メタルカバちゃん", "メタルゴマさま", "エンジェ・ルース", "大天使チビネル"]
            },
            {
                "stage": "ひんやりチョコ霊廟",
                "energy": 230,
                "enemies": ["シスターデビル", "赤毛のにょろ", "セレブ", "コニャンダム", "ナカイくん", "ヘルゴリラー", "ミッドナイトナカイ"]
            },
        ]
    },
    {
        "name": "リバース聖墓",
        "stages": [
            {
                "stage": "でっぷりミイラ",
                "energy": 200,
                "enemies": ["ブタヤロウ", "トンシー", "天使ブッタ", "エリザベス56世", "エリザベス2世"]
            },
            {
                "stage": "天国ハラスメント",
                "energy": 230,
                "enemies": ["はぐれたヤツ", "ハサミーマン", "ヨキカナ", "聖天ゴクラッコ", "エンジェ・ルース"]
            },
            {
                "stage": "コンプライアンス地獄",
                "energy": 220,
                "enemies": ["ギルティ・ペン", "怒りのブラッゴリ", "超町長", "こぶへい", "ミニホワイトサイクロン", "イノシャシ"]
            },
            {
                "stage": "活きのいい死霊たち",
                "energy": 210,
                "enemies": ["ゾンビワン", "殺意のわんこ", "ワーニック", "スリラーズ", "アンドロメ・ダ長官", "ダ・チョー老"]
            },
            {
                "stage": "よこしまな聖職者",
                "energy": 150,
                "enemies": ["ウルトラメェメェ", "チンアナ5兄弟", "名賢わんこ", "メガメェメェ", "ツバサターン"]
            },
            {
                "stage": "あの世行き往復券",
                "energy": 250,
                "enemies": ["名賢わんこ", "ウサ銀", "イングリッス", "森の蜜子", "テク・ノロ爺", "オオウサ銀", "カルピンチョ"]
            },
        ]
    },
    {
        "name": "眠りの深淵",
        "stages": [
            {
                "stage": "偽りの寝言",
                "energy": 210,
                "enemies": ["セレブ", "クロマジロ", "ドクターK.O.", "怒りのブラッゴリ", "ごん兵衛", "ドヴェルダーク"]
            },
            {
                "stage": "空中寝返り",
                "energy": 220,
                "enemies": ["ワニボン", "天使ガブリエル", "ゴリ・ンジュ", "タッキー", "ブチゴマさま", "ふくろう博士", "天使ドーヴエル"]
            },
            {
                "stage": "夢と幻",
                "energy": 250,
                "enemies": ["ウルトラメェメェ", "ツバサターン", "クロマジロ", "デビルワン", "大夢くん", "魔我王"]
            },
            {
                "stage": "いびき祈祷",
                "energy": 180,
                "enemies": ["セレブ", "フグ太くん", "ケロ助", "テッポー", "超新星テッサー"]
            },
            {
                "stage": "二度寝禁止区域",
                "energy": 200,
                "enemies": ["リッスントゥミー", "にょろ", "ギルティ・ペン", "エンジェ・ルース", "メガメェメェ", "悪魔ベヒモッス"]
            },
            {
                "stage": "眠りたての愛",
                "energy": 200,
                "enemies": ["殺意のわんこ", "クロマジロ", "プドール夫人", "ハサミーマン", "スペースサイクロン", "ふくろう博士", "わんこずきんミーニャ"]
            },
        ]
    },
    {
        "name": "忘却共和国",
        "stages": [
            {
                "stage": "置き去りバス停",
                "energy": 190,
                "enemies": ["エイリワン", "天使ガブリエル", "スター・ペン", "天使ゴンザレス", "イノエンジェル", "聖天ゴクラッコ", "エンジェ・ルース", "よっちゃん", "イノヴァルカン"]
            },
            {
                "stage": "返却なき図書館",
                "energy": 210,
                "enemies": ["ケルベローズ", "殺意のわんこ", "名賢わんこ", "シャドウボクサー", "古兵器マンボロス", "デスコアラッキョ"]
            },
            {
                "stage": "繰り返される昼食",
                "energy": 230,
                "enemies": ["にょろろん", "赤毛のにょろ", "古代わんこ", "オオウサ銀", "教授", "テッポー", "シノシシ"]
            },
            {
                "stage": "何の行列だっけ広場",
                "energy": 190,
                "enemies": ["烈波砲", "赤毛のにょろ", "デヴィル夫人", "ミスターエンジェル", "ギルティ・ペン", "マンボーグ鈴木", "レッド・エナG", "ミニエンジェルサイクロン"]
            },
            {
                "stage": "増殖するスペアキー",
                "energy": 200,
                "enemies": ["スリラーズ", "エリートエイリワン", "スカルボクサー", "アンドロメ・ダ長官", "ふくろう博士", "ダッフンデッド"]
            },
            {
                "stage": "アレソレ議事堂",
                "energy": 240,
                "enemies": ["ハニワンワン", "シスターデビル", "ブラッコ", "オールドリー", "クロマジロ", "松 黒蔵", "シャチコ"]
            },
        ]
    },
    {
        "name": "ブック列島",
        "stages": [
            {
                "stage": "活字海域",
                "energy": 220,
                "enemies": ["ワーニック", "天使カバちゃん", "古我王", "ちびわんこ", "イングリッス", "サイバーX", "大天使チビネル", "コライノくん", "カヲルさん"]
            },
            {
                "stage": "死臭ポエム",
                "energy": 180,
                "enemies": ["インフェルにょろ", "チキランラン", "墓手花子", "アックマ閣下", "トロリンチョ", "ヒツギイヌ", "ミッドナイトナカイ"]
            },
            {
                "stage": "クスクスコミックス",
                "energy": 210,
                "enemies": ["イングリッス", "殺意のわんこ", "クロサワ監督", "ウリボーイ", "赤羅我王", "パラサイトブンブン"]
            },
            {
                "stage": "ディクショナリー地所",
                "energy": 220,
                "enemies": ["デビルワン", "天使ガブリエル", "怒りのブラッゴリ", "ドヴェルダーク", "マデューさん", "天使メガミエル"]
            },
            {
                "stage": "お気持ちノベル",
                "energy": 190,
                "enemies": ["メタルサイボーグ", "ジョン・レオン", "ブラッゴリ", "タッちゃん", "メタルわんこ", "メタルコアラッキョ"]
            },
            {
                "stage": "マ=ガ寺院",
                "energy": 240,
                "enemies": ["例のヤツ", "古代わんこ", "ジャッキー・ペンZ", "ダ・チョー老", "超町長", "だっふんど"]
            },
        ]
    },
    {
        "name": "虚栄カンパニー",
        "stages": [
            {
                "stage": "貧弱エビデンス",
                "energy": 200,
                "enemies": ["デビルワン", "シスターデビル", "スター・ペン", "ヘルゴリラー", "アンドロメ・ダ長官", "テク・ノロ爺", "デヴィル夫人"]
            },
            {
                "stage": "ゆるふわフィックス",
                "energy": 150,
                "enemies": ["オオさん", "ツバメンズ", "テバムラサキホネツバメ", "ツバサターン"]
            },
            {
                "stage": "幻のオンスケ",
                "energy": 210,
                "enemies": ["名賢わんこ", "ド鳩・サブ・レー", "ドクターK.O.", "真レジェンドブンブン", "シャチコ", "エリザベス56世"]
            },
            {
                "stage": "なるはやエブリデー",
                "energy": 240,
                "enemies": ["教授", "殺意のわんこ", "タッキー", "ハニワンワン", "オオウサ銀", "こぶへい"]
            },
            {
                "stage": "お前のマター",
                "energy": 210,
                "enemies": ["はぐれたヤツ", "スリラーズ", "赤毛のにょろ", "怒りのブラッゴリ", "エンジェ・ルース", "デビルカツヤ", "ヒウマ", "タッちゃん"]
            },
            {
                "stage": "俺のイシュー",
                "energy": 250,
                "enemies": ["ワーニネーター", "古代わんこ", "超メタルカバちゃん", "オールドリー", "フグ太くん"]
            },
        ]
    },
    {
        "name": "マジカ幻想郷",
        "stages": [
            {
                "stage": "タウロス街道",
                "energy": 210,
                "enemies": ["赤毛のにょろ","殺意のわんこ","コアラッキョ","まゆげどり","イルカ娘","バトルコアラッキョ","ブラックブンブン"]
            },
            {
                "stage": "マーメイド喫茶",
                "energy": 190,
                "enemies": ["ゴマさま","ゴマサーマン","ブチゴマさま","メタルゴマさま"]
            },
            {
                "stage": "不死町",
                "energy": 210,
                "enemies": ["ゾンビワン","トンシー","にょろろん","例のヤツ","ハイ・エナジー","墓手太郎","スカルボクサー","ヨキカナ","ハサミーマン"]
            },
            {
                "stage": "フェアリーディスコ",
                "energy": 200,
                "enemies": ["天使カバちゃん","古代わんこ","魔我王","インフェルノにょろ","デヴィル夫人","天使ゴンザレス","天使スレイプニール","ダテメガネル"]
            },
            {
                "stage": "ユニコーン塩湖",
                "energy": 200,
                "enemies": ["名賢わんこ","殺意のわんこ","デカメガネル","怒りのブラッゴリ","ドヴェルダーク","クマンチュー","キョセーヌ","クロマジロ"]
            },
            {
                "stage": "ドラゴンダイナー",
                "energy": 230,
                "enemies": ["名賢わんこ","天使ヒオコエル","フルぼっこ","ミスターエンジェル","天使ブッタ","ヒカル","天使メガミエル"]
            },
        ]
    },
    {
        "name": "マッスルエンパイア",
        "stages": [
            {
                "stage": "バルク大地",
                "energy": 200,
                "enemies": ["インフェルにょろ", "タッキー", "ツバサターン", "ミッドナイトナカイ", "超町長"]
            },
            {
                "stage": "プロテイン砂漠",
                "energy": 150,
                "enemies": ["殺意のわんこ", "ブラッコ", "チキランラン", "イノワール", "キャベロン", "ふくろう博士", "ダッフンデッド"]
            },
            {
                "stage": "マジカルフィジカル",
                "energy": 220,
                "enemies": ["エリートエイリワン", "ハニワンワン", "スペースマンボルグ", "巨匠", "グレゴリー将軍", "イングリッス", "テク・ノロ爺", "シャチコ"]
            },
            {
                "stage": "欺きのムキムキ",
                "energy": 200,
                "enemies": ["ゴマさま", "アカンゾウ", "赤毛のにょろ", "シャドウボクサー", "クロマジロ"]
            },
            {
                "stage": "肩乗りユンボ",
                "energy": 240,
                "enemies": ["名賢わんこ", "アヒルンルン", "天使ゴンザレス", "マーさん", "聖天ゴクラッコ", "ドリュウ", "イカ天"]
            },
            {
                "stage": "サイドチェス島",
                "energy": 250,
                "enemies": ["ド鳩・サブ・レー", "デヴィル夫人", "アカンゾウ", "ミニホワイトサイクロン", "ドクターK.O.", "悪魔ベヒモッス"]
            },
        ]
    },
    {
        "name": "美術工房アートリエ",
        "stages": [
            {
                "stage": "前衛的な印象派",
                "energy": 190,
                "enemies": ["例のヤツ", "名賢わんこ", "オオウサ銀", "スター・ペン", "カルピンチョ", "イノシャシ", "イノヴァルカン", "ギャラクシーニャンダム"]
            },
            {
                "stage": "ちぐはぐタイポグラフィ",
                "energy": 180,
                "enemies": ["ワニック", "にょろ", "天使ガブリエル", "殺意のわんこ", "怒りのブラッゴリ", "リッスントゥミー", "ドヴェルダーク", "エンジェ・ルース", "タッちゃん"]
            },
            {
                "stage": "コラージュ畑",
                "energy": 210,
                "enemies": ["ウルトラメェメェ", "ゾンビワン", "イングリッス", "ハサミーマン", "コライノくん", "トンシー", "エリザベス56世", "古兵器マンボロス"]
            },
            {
                "stage": "オマージュとパロディ",
                "energy": 190,
                "enemies": ["リッスントゥミー", "スリラーズ", "ミスターエンジェル", "メガメェメェ", "ミニアンデッドサイクロン", "だっふんど", "トロリンチョ", "シノシシ", "クマンケン", "大天使チビネル"]
            },
            {
                "stage": "グロッキークロッキー",
                "energy": 230,
                "enemies": ["インフェルにょろ", "ウサ銀", "デヴィル夫人", "マデューさん", "ふくろう博士", "ごん兵衛", "レッド・エナG", "魔我王"]
            },
            {
                "stage": "彩りトリミング",
                "energy": 260,
                "enemies": ["赤毛のにょろ", "ゴマさま", "古代わんこ", "シャドウボクサー", "ダテメガネル", "ブラックブンブン", "赤井ブン太郎", "教授"]
            },
        ]
    },
    {
        "name": "変異を伴う継承の楽園",
        "stages": [
            {
                "stage": "シュノキ原野",
                "energy": 180,
                "enemies": ["ヤドカリー", "ナマルケモルル", "リッスントゥミー", "赤毛のにょろ", "アカンゾウ", "ウリボーイ"]
            },
            {
                "stage": "トータル自然淘汰",
                "energy": 200,
                "enemies": ["ゾンビワン", "インフェルにょろ", "ブラッゴリ", "ツバサターン", "松 黒蔵", "スカルボクサー", "アックマ閣下"]
            },
            {
                "stage": "信仰と科学の狭間",
                "energy": 170,
                "enemies": ["ワニック", "ブタヤロウ", "マンボーグ鈴木", "ナカイくん", "ドクターK.O.", "天使メガミエル", "ケロ助", "テッポー"]
            },
            {
                "stage": "ガッツリライフツリー",
                "energy": 190,
                "enemies": ["メタルわんこ", "古代わんこ", "シスターデビル", "ヘルゴリラー", "古我王", "シャチコ", "メタルサイボーグ", "デビルカツヤ"]
            },
            {
                "stage": "適者生存処刑場",
                "energy": 220,
                "enemies": ["カバタリアン", "スター・ペン", "テバムラサキホネツバメ", "ワニボン", "墓手花子", "ゴリ・ンジュ", "テク・ノロ爺", "名賢わんこ", "ダッフンデッド"]
            },
            {
                "stage": "最も美しき無限の形",
                "energy": 300,
                "enemies": ["天使ガブリエル", "名賢わんこ", "スリラーズ", "ジャッキー・ペンZ", "プドール夫人", "アンドロメ・ダ長官", "イノエンジェル", "淘の賢者ダーヴィン"]
            },
        ]
    },
    {
        "name": "ニューホライズン",
        "stages": [
            {
                "stage": "遥かなる赤土の荒野",
                "energy": 160,
                "enemies": ["殺意のわんこ", "名賢わんこ", "レディ・ガ", "エリザベス56世", "ドヴェルダーク", "ブラッコ", "テク・ノロ爺", "ワーニック"]
            },
            {
                "stage": "跳躍する影の群れ",
                "energy": 180,
                "enemies": ["古代砲", "ウサ銀", "カ・ンガリュ", "シャドウボクサー", "ダ・チョー老", "アルパッカ", "ドクターK.O.", "ドリュウ"]
            },
            {
                "stage": "コアラ昼寝地帯",
                "energy": 200,
                "enemies": ["ワーニネーター", "コアラッキョ", "シスターデビル", "ツバサターン", "デスコアラッキョ", "テッポー", "メタルコアラッキョ"]
            },
            {
                "stage": "巨大防壁岩礁",
                "energy": 220,
                "enemies": ["プドール夫人", "ハサミーマン", "にょろ", "レジェンドブンブンΩ", "ふくろう博士", "ド鳩・サブ・レー"]
            },
            {
                "stage": "燃え萌えツリー",
                "energy": 250,
                "enemies": ["ワニボン", "名賢わんこ", "怒りのブラッゴリ", "クロサワ監督", "アンデッドサイクロン", "トロリンチョ", "メガメェメェ", "チキランラン", "ミニアンデッドサイクロン"]
            },
            {
                "stage": "ネコのおへそ",
                "energy": 250,
                "enemies": ["リッスントゥミー", "イングリッス", "クマ先生", "ツバサターン", "ウリボーイ", "チワワン伯爵", "ミッドナイトナカイ"]
            },
        ]
    },
    {
        "name": "ン・トーベ地方",
        "stages": [
            {
                "stage": "バラバラバラン草原",
                "energy": 220,
                "enemies": ["例のヤツ", "ドクターK.O.", "天使ゴンザレス", "天使ブッタ", "オオウサ銀", "ヒウマ", "大天使チビネル", "イノエンジェル"]
            },
            {
                "stage": "忘れられた橋",
                "energy": 240,
                "enemies": ["ハニワンワン", "プドール夫人", "キャプテン・モグー", "アンドロメ・ダ長官", "ルーパールーパー", "シャチコ"]
            },
            {
                "stage": "高密度おにぎり山脈",
                "energy": 100,
                "enemies": ["カオル君", "殺意のわんこ", "ゴマさま", "リッスントゥミー", "ブラックマ", "ふくろう博士", "コライノくん"]
            },
            {
                "stage": "謎の汁湖",
                "energy": 220,
                "enemies": ["ナマルケモルル", "ゴリさん", "怒りのブラッゴリ", "天使ドーヴエル", "エンジェ・ルース", "アヒルンルン"]
            },
            {
                "stage": "醤油さし魚群",
                "energy": 230,
                "enemies": ["トンシー", "デヴィル夫人", "シスターデビル", "ダッフンデッド", "デビルサイクロン", "ギルティ・ペン", "シノシシ"]
            },
            {
                "stage": "夕飯の終着点",
                "energy": 250,
                "enemies": ["一角くん", "名賢わんこ", "ちびぶんぶん", "真レジェンドブンブン", "天使メガミエル", "ダテメガネル"]
            },
        ]
    },
    {
        "name": "おしゃれクレイジー",
        "stages": [
            {
                "stage": "全身たわしスーツ",
                "energy": 200,
                "enemies": ["ゴマサーマン", "ギルティ・ペン", "アカンゾウ", "オオウサ銀", "テク・ノロ爺", "ドクターK.O."]
            },
            {
                "stage": "ダンベルイヤリング",
                "energy": 210,
                "enemies": ["わんこ", "にょろ", "例のヤツ", "天使ガブリエル", "イングリッス", "フルぼっこ", "メガメェメェ", "聖天ゴクラッコ", "ミニエンジェルサイクロン", "マンボーグ鈴木"]
            },
            {
                "stage": "異様な肩パッド",
                "energy": 230,
                "enemies": ["エイリワン", "ワーニック", "リッスントゥミー", "スター・ペン", "ハニワンワン", "クロサワ監督", "コライノくん"]
            },
            {
                "stage": "食べられるシャツ",
                "energy": 200,
                "enemies": ["ワニボン", "殺意のわんこ", "名賢わんこ", "カバタリアン", "にょろろん", "ゴリ・ンジュ", "シャドウボクサー", "イノワール", "ヒカル"]
            },
            {
                "stage": "避雷針ハット",
                "energy": 200,
                "enemies": ["烈波砲", "メタルわんこ", "ゴマさま", "メタルカバちゃん", "ちびわんこ", "メタルゴマさま", "ごん兵衛"]
            },
            {
                "stage": "刃物のような襟",
                "energy": 220,
                "enemies": ["にょろ", "例のヤツ", "古代わんこ", "デビルワン", "ツバサターン", "超町長", "ヘルゴリラー", "ミッドナイトナカイ", "古兵器マンボロス"]
            },
        ]
    },
];

const enemies=[];

    for(const chapter of chapters){
        for(const stage of chapter.stages){
            for(const enemy of stage.enemies){
                if(!enemies.includes(enemy)){
                    enemies.push(enemy);
                }
            }
        }
    }

const yomi = {
    "古代わんこ":"こだいわんこ",
    "真レジェンドぶんぶん":"しんれじぇんどぶんぶん",
    "例のヤツ":"れいのやつ",
    "超メタルカバちゃん":"ちょうめたるかばちゃん",
    "師匠":"ししょう",
    "悪の帝王ニャンダム":"あくのていおうにゃんだむ",
    "教授":"きょうじゅ",
    "赤毛のにょろ":"あかげのにょろ",
    "天使ガブリエル":"てんしがぶりえる",
    "天使ブッタ":"てんしぶった",
    "一角くん":"いっかくくん",
    "悪魔ベヒモッス":"あくまべひもっす",
    "巨匠":"きょしょう",
    "古我王":"こがおう",
    "殺意のわんこ":"さついのわんこ",
    "古兵器マンボロス":"こへいきまんぼろす",
    "松 黒蔵":"まつ くろぞう",
    "真レジェンドブンブン":"しんれじぇんどぶんぶん",
    "赤井ブン太郎":"あかいぶんたろう",
    "赤羅我王":"あからがおう",
    "大天使チビネル":"だいてんしちびねる",
    "大夢くん":"おおむくん",
    "超闇獣ダックジョー":"ちょうあんじゅうだっくじょー",
    "超猿獣ルーザ":"ちょうえんじゅうるーざ",
    "超古獣ナーラ":"ちょうこじゅうなーら",
    "超生命体ゼロルーザ":"ちょうせいめいたいぜろるーざ",
    "超町長":"ちょうちょうちょう",
    "超爆獣アリアント":"ちょうばくじゅうありあんと",
    "超翼獣ピヨルーツ":"ちょうよくじゅうぴよるーつ",
    "超竜獣オウルハズク":"ちょうりゅうじゅうおうるはずく",
    "天使ゴンザレス":"てんしごんざれす",
    "天使カバちゃん":"てんしかばちゃん",
    "天使スレイプニール":"てんしすれいぷにーる",
    "天使ドーヴエル":"てんしどーヴえる",
    "天使ヒオコエル":"てんしひおこえる",
    "土偶戦士ドグ丸":"どぐうせんしどぐまる",
    "怒りのブラッゴリ":"いかりのぶらっこり",
    "破壊生物クオリネン":"はかいせいぶつくおりねん",
    "墓手花子":"はかてはなこ",
    "墓手太郎":"はかてたろう",
    "魔我王":"まがおう",
    "野生のわんこ":"やせいのわんこ",
    "純金倶楽部":"じゅんきんくらぶ",
    "森の蜜子":"もりのみつこ",
    "神さま":"かみさま",
    "聖天ゴクラッコ":"せいてんごぐらっこ",
    "断罪天使クオリネル":"だんざいてんしくおりねる",
    "超魚獣アンガブル":"ちょうぎょじゅうあんがぶる",
    "超古獣マガモジョー":"ちょうこじゅうまがもじょー",
    "超甲獣シザーレックス":"ちょうこうじゅうしざーれっくす",
    "超象獣パパオウ":"ちょうぞうじゅうぱぱおう",
    "超新星テッサー":"ちょうしんせいてっさー",
    "超舌獣ラングマスター":"ちょうぜつじゅうらんぐますたー",
    "超鳥獣アヒルジョー":"ちょうちょうじゅうあひるじょー",
    "超天獣ラジャコング":"ちょうてんじゅうらじゃこんぐ",
    "超豚獣ピーギィ":"ちょうとんじゅうぴーぎぃ",
    "超棘獣ナマケモルガ":"ちょうきょくじゅうなまけもるが",
    "天使メガミエル":"てんしめがみえる",
    "謎仮面のウララー":"なぞかめんのうららー",
    "柏餅2.0":"かしわもち",
    "淘の賢者ダーヴィン":"とうのけんじゃだーヴぃん",
    "反逆のヴァルキリー":"はんぎゃくのヴぁるきりー",
    "般若我王":"はんにゃがおう",
    "名賢わんこ":"めいけんわんこ",
    "論の賢者ソラクティス":"ろんのけんじゃそらくてぃす",
    "理の賢者ニュトーン":"ことわりのけんじゃにゅとーん",
    "亡者デブウ":"もうじゃでぶう"
};

/*敵を順番に*/
enemies.sort((a,b)=>{
    const youmiA = yomi[a] || a;
    const youmiB = yomi[b] || b;
    return youmiA.localeCompare(youmiB,"ja");
});


/* 選択肢の追加 */
const boxes = document.querySelectorAll(".box");

for(const box of boxes){
    for(const enemy of enemies){
        box.innerHTML += 
        `<option value="${enemy}">
           ${enemy}
        </option>`;
    }
}