const chapters = [
    {
        "name": "真・伝説のはじまり",
        "stages": [
            {
                "stage": "古代の呪い",
                "energy": 200,
                "enemies": ["古代わんこ", "真レジェンドブンブン", "カンバン娘"]
            },
        ]
    },
    {
        "name": "まんぷく秘境",
        "stages": [
            {
                "stage": "ピラフ大草原",
                "energy": 160,
                "enemies": ["古代わんこ", "にょろ", "例のヤツ", "ゴリさん"]
            },
            {
                "stage": "ニャンダルメシアン",
                "energy":170,
                "enemies": ["古代わんこ","にょろ","例のヤツ","超メタルカバちゃん"]
            },
            {
                "stage": "アンニン峠",
                "energy": 180,
                "enemies": ["コライノくん"]
            },
            {
                "stage": "アヒージョ高原",
                "energy": 165,
                "enemies": ["エイリワン", "にょろ", "例のヤツ", "ゴマサーマン", "エリザベス56世"]
            },
            {
                "stage": "パスタ砂丘",
                "energy": 175,
                "enemies": ["古代わんこ", "にょろ", "例のヤツ", "ワニボン", "師匠"]
            },
            {
                "stage": "ルーロウ丘陵",
                "energy": 200,
                "enemies": ["悪の帝王ニャンダム", "コライノくん", "リッスントゥミー"]
            },
        ]
    },
    {
        "name": "アドベン大森林",
        "stages": [
            {
                "stage": "コサ民遺跡",
                "energy": 175,
                "enemies": ["天使ガブリエル", "にょろ", "例のヤツ", "天使ブッタ"]
            },
            {
                "stage": "デンジロー海原",
                "energy": 175,
                "enemies": ["ワーニック", "プドール夫人", "メタルゴマさま"]
            },
            {
                "stage": "山賊かぶれ",
                "energy": 165,
                "enemies": ["ウサ銀", "例のヤツ", "古代わんこ", "赤毛のにょろ", "ブタヤロウ", "コライノくん"]
            },
            {
                "stage": "くりくりくぼみ",
                "energy": 165,
                "enemies": ["ゾンビワン", "にょろろん", "トンシー", "アヒルンルン", "だっふんど"]
            },
            {
                "stage": "スリルの談笑",
                "energy": 170,
                "enemies": ["例のヤツ", "プドール夫人", "フルぼっこ", "教授", "ヨキカナ"]
            },
            {
                "stage": "ジャン・グール",
                "energy": 200,
                "enemies": ["イングリッス", "イノシャシ", "イノヴァルカン"]
            },
        ]
    },
    {
        "name": "じゃぶじゃぶ旧海道",
        "stages": [
            {
                "stage": "マリネタウン",
                "energy": 180,
                "enemies": ["古代わんこ", "にょろ", "ウルトラメェメェ", "メタルカバちゃん", "ゴリさん", "グレゴリー将軍"]
            },
            {
                "stage": "さすらいのホラガイ",
                "energy": 160,
                "enemies": ["ゾンビワン", "にょろろん", "松 黒蔵", "カバタリアン", "ジャッキー・ペンZ"]
            },
            {
                "stage": "パルカッチョ海溝",
                "energy": 170,
                "enemies": ["天使カバちゃん", "ミスターエンジェル", "天使ガブリエル", "天使ゴンザレス", "イノシャシ"]
            },
            {
                "stage": "ウツボボ海底火山",
                "energy": 175,
                "enemies": ["コアラッキョ", "コライノくん", "バトルコアラッキョ", "ウサ銀"]
            },
            {
                "stage": "暁フロンターレ",
                "energy": 165,
                "enemies": ["古代わんこ", "にょろ", "例のヤツ", "イングリッス", "ナカイくん", "ナマルケモルル"]
            },
            {
                "stage": "ルツボー渦",
                "energy": 200,
                "enemies": ["ワニック", "リッスントゥミー", "ガガガガ", "イングリッス", "古代わんこ", "天使ガブリエル", "天使スレイプニール", "天使ゴンザレス", "天使カバちゃん", "超町長"]
            },
        ]
    },
    {
        "name": "ワンワン湾",
        "stages": [
            {
                "stage": "ビッチビチ漁場",
                "energy": 175,
                "enemies": ["はぐれたヤツ", "超メタルカバちゃん", "巨匠"]
            },
            {
                "stage": "反抗的経済水域",
                "energy": 165,
                "enemies": ["天使カバちゃん", "カバタリアン", "だっふんど"]
            },
            {
                "stage": "カマトロ防波堤",
                "energy": 165,
                "enemies": ["カルピンチョ", "超町長"]
            },
            {
                "stage": "怪獣ショー岩窟",
                "energy": 180,
                "enemies": ["メタルわんこ", "メタルサイボーグ", "ブラックブンブン", "クロサワ監督"]
            },
            {
                "stage": "タツノコ浜",
                "energy": 185,
                "enemies": ["イングリッス", "コライノくん"]
            },
            {
                "stage": "イカス岬",
                "energy": 200,
                "enemies": ["ゴマさま", "ブラッゴリ", "古代わんこ", "赤毛のにょろ", "ワニボン", "トンシー", "ブラッコ", "ダテメガネル"]
            },
        ]
    },
    {
        "name": "深淵を覗く者",
        "stages": [
            {
                "stage": "ガチガチ暗黒兵器",
                "energy": 180,
                "enemies": ["わんこ", "殺意のわんこ", "赤羅我王", "ヒカル"]
            },
            {
                "stage": "かわいい壁画",
                "energy": 170,
                "enemies": ["リッスントゥミー", "ガガガガ", "イングリッス", "超町長", "赤井ブン太郎"]
            },
            {
                "stage": "サンシャイン洞窟",
                "energy": 170,
                "enemies": ["ブラッゴリ", "古代わんこ", "シャドウボクサー", "イングリッス", "コライノくん"]
            },
            {
                "stage": "鍾乳石イルミネーション",
                "energy": 175,
                "enemies": ["マンボーグ鈴木", "天使ガブリエル", "天使スレイプニール", "ダテメガネル"]
            },
            {
                "stage": "ゲッソリ性悪説",
                "energy": 175,
                "enemies": ["例のヤツ", "リッスントゥミー", "ウルトラメェメェ", "カバタリアン", "ジャッキー・ペンZ", "フルぼっこ", "メタルカバちゃん", "こぶへい", "ブラックマ", "カンバン娘"]
            },
            {
                "stage": "まったり地底湖",
                "energy": 200,
                "enemies": ["古我王", "イングリッス", "イノシャシ"]
            },
        ]
    },
    {
        "name": "デスメガシティ",
        "stages": [
            {
                "stage": "リコピンの夜更け",
                "energy": 170,
                "enemies": ["メタルわんこ", "にょろ", "例のヤツ", "ウルトラメェメェ", "ハハパオン", "超メタルカバちゃん", "グレゴリー将軍", "スター・ペン"]
            },
            {
                "stage": "メトロポリスオアシス",
                "energy": 175,
                "enemies": ["にょろ", "例のヤツ", "ジャッキー・ペン", "セレブ", "師匠", "教授", "巨匠"]
            },
            {
                "stage": "はりぼて摩天楼",
                "energy": 170,
                "enemies": ["ウサ銀", "ブタヤロウ", "トンシー", "ゾンビワン", "ヒツギイヌ", "ゴリ・ンジュ", "ワニボン", "古代わんこ", "古我王"]
            },
            {
                "stage": "ならず者の黄昏",
                "energy": 185,
                "enemies": ["わんこ", "にょろ", "ジャッキー・ペン", "ブタヤロウ", "セレブ", "ガガガガ", "イングリッス", "ダテメガネル", "超町長"]
            },
            {
                "stage": "コンクリートオーシャン",
                "energy": 180,
                "enemies": ["フルぼっこ", "ブラッコ", "カ・ンガリュ", "シャドウボクサー", "カルピンチョ"]
            },
            {
                "stage": "無人駅の決闘",
                "energy": 210,
                "enemies": ["リッスントゥミー", "古代わんこ", "エリートエイリワン", "ヨキカナ", "オールドリー"]
            },
        ]
    },
    {
        "name": "無法地帯のオキテ",
        "stages": [
            {
                "stage": "イグサ塔",
                "energy": 160,
                "enemies": ["ゾンビワン", "にょろろん", "例のヤツ", "クマンケン", "クマ先生", "ウサ銀", "殺意のわんこ"]
            },
            {
                "stage": "カウガール監獄",
                "energy": 170,
                "enemies": ["エリザベス2世", "アヒルンルン", "エリザベス56世", "天使ブッタ", "リッスントゥミー"]
            },
            {
                "stage": "N.G.牧場",
                "energy": 180,
                "enemies": ["ブラッゴリ", "松 黒蔵", "オールドリー"]
            },
            {
                "stage": "ハンチング山",
                "energy": 180,
                "enemies": ["わんこ", "にょろ", "だっふんど", "セレブ", "ドリュウ", "ケロ助"]
            },
            {
                "stage": "ビクビク高原",
                "energy": 190,
                "enemies": ["例のヤツ", "にょろ", "カバちゃん", "ゴリさん", "にょろろん", "カバタリアン", "ゴリ・ンジュ", "シノシシ", "イノシャシ"]
            },
            {
                "stage": "デッドリボルバー渓谷",
                "energy": 210,
                "enemies": ["古我王", "ダディ", "コアラッキョ", "ド鳩・サブ・レー"]
            },
        ]
    },
    {
        "name": "パラリラ半島",
        "stages": [
            {
                "stage": "シロマグロ海岸",
                "energy": 180,
                "enemies": ["わんこの城", "カベわんこ", "イルカ娘", "マナブくん", "悪の帝王ニャンダム"]
            },
            {
                "stage": "究極兵器トド",
                "energy": 175,
                "enemies": ["スター・ペン", "イカ天", "ゲコック", "リッスントゥミー"]
            },
            {
                "stage": "ドジョウ破り",
                "energy": 155,
                "enemies": ["コライノくん", "オオさん"]
            },
            {
                "stage": "ウミネコ湾岸",
                "energy": 175,
                "enemies": ["ワニック", "ワニボン", "一角くん", "ゴマさま", "ブチゴマさま", "キャベロン"]
            },
            {
                "stage": "べろべろ沼",
                "energy": 195,
                "enemies": ["メタルカバちゃん", "アヒルンルン", "超メタルカバちゃん", "タッちゃん", "シャドウボクサー"]
            },
            {
                "stage": "おれおれサギ",
                "energy": 210,
                "enemies": ["例のヤツ", "リッスントゥミー", "ミスターエンジェル", "イングリッス", "オールドリー", "天使ゴンザレス", "天使カバちゃん", "天使スレイプニール", "破壊生物クオリネン"]
            },
        ]
    },
    {
        "name": "キャットクーデター",
        "stages": [
            {
                "stage": "コオロギイデオロギー",
                "energy": 180,
                "enemies": ["はぐれたヤツ", "カバタリアン", "スター・ペン", "天使ゴンザレス", "シャドウボクサー", "古我王"]
            },
            {
                "stage": "穴ぐらの最高権力者",
                "energy": 170,
                "enemies": ["コライノくん", "一角くん", "メタルサイボーグ", "サイバーX"]
            },
            {
                "stage": "人民とにんじん",
                "energy": 180,
                "enemies": ["ヒツギイヌ", "クマンケン", "ブラックマ"]
            },
            {
                "stage": "密告者軍団",
                "energy": 170,
                "enemies": ["ヒウマ", "ヒカル", "ケロ助", "マナブくん", "ゲコック", "ハハパオン"]
            },
            {
                "stage": "亡命前夜の奇襲",
                "energy": 180,
                "enemies": ["メタルカオル君", "カオル君"]
            },
            {
                "stage": "レッドキャット作戦",
                "energy": 210,
                "enemies": ["真レジェンドブンブン", "オールドリー", "超町長"]
            },
        ]
    },
    {
        "name": "桜んぼ島",
        "stages": [
            {
                "stage": "溶岩温浴",
                "energy": 190,
                "enemies": ["カバちゃん", "ブタヤロウ", "ジャッキー・ペン", "こぶへい", "アルパッカ", "キャベロン"]
            },
            {
                "stage": "音速火砕流",
                "energy": 180,
                "enemies": ["ジャッキー・ペン", "ゴマさま", "ウサ銀", "イノワール", "イノエンジェル", "イノシャシ"]
            },
            {
                "stage": "灰の雨、愛のため",
                "energy": 160,
                "enemies": ["ブラックマ", "メタルカバちゃん"]
            },
            {
                "stage": "頂の大賢者",
                "energy": 180,
                "enemies": ["赤羅我王", "ぶんぶん先生"]
            },
            {
                "stage": "暴虐カルデラ",
                "energy": 200,
                "enemies": ["わんこ", "にょろ", "例のヤツ", "殺意のわんこ", "赤毛のにょろ", "コアラッキョ"]
            },
            {
                "stage": "スーパーボルケーノ",
                "energy": 220,
                "enemies": ["サイバーX", "リッスントゥミー", "古代わんこ", "イングリッス", "キャプテン・モグー", "コライノくん"]
            },
        ]
    },
    {
        "name": "魂底からの帰化",
        "stages": [
            {
                "stage": "へんな讃美歌",
                "energy": 180,
                "enemies": ["古代わんこ", "レディ・ガ", "超町長"]
            },
            {
                "stage": "練乳修洞窟の乙女",
                "energy": 170,
                "enemies": ["エリートエイリワン", "グレゴリー将軍", "ハサミーマン"]
            },
            {
                "stage": "良いノリの祈り",
                "energy": 190,
                "enemies": ["キョセーヌ", "リッスントゥミー", "イングリッス"]
            },
            {
                "stage": "ルサンチマンの森",
                "energy": 180,
                "enemies": ["メタルわんこ", "にょろ", "例のヤツ", "メェメェ", "超メタルカバちゃん", "天使ブッタ"]
            },
            {
                "stage": "おしゃべり世捨て人",
                "energy": 190,
                "enemies": ["ゾンビワン","にょろろん","はぐれたヤツ","巨匠"]
            },
            {
                "stage": "原始に宿る魂",
                "energy": 220,
                "enemies": ["ガガガガ", "赤毛のにょろ", "ブラッコ", "土偶戦士ドグ丸"]
            },
        ]
    },
    {
        "name": "絶滅海洋タウン",
        "stages": [
            {
                "stage": "イワロック岩礁",
                "energy": 180,
                "enemies": ["ウサ銀", "スター・ペン", "プドール夫人", "チンアナ5兄弟", "教授"]
            },
            {
                "stage": "オウム貝の墓場",
                "energy": 170,
                "enemies": ["墓手太郎", "ドリュウ", "にょろろん", "ワニボン", "カ・ンガリュ"]
            },
            {
                "stage": "海より還りし亡者",
                "energy": 180,
                "enemies": ["カオル君", "コライノくん", "ミニスターサイクロン"]
            },
            {
                "stage": "人面魚の渚",
                "energy": 190,
                "enemies": ["ワーニック", "ウルトラメェメェ", "ブラッゴリ", "天使ゴンザレス", "天使ヒオコエル", "松 黒蔵"]
            },
            {
                "stage": "らくだ岸壁",
                "energy": 190,
                "enemies": ["古代わんこ", "殺意のわんこ", "リッスントゥミー", "超町長", "赤羅我王", "古我王"]
            },
            {
                "stage": "視界なき死海",
                "energy": 220,
                "enemies": ["ルーパールーパー", "デカメガネル", "ジャッキー・ペンZ", "カバタリアン"]
            },
        ]
    },
    {
        "name": "島流しリゾート",
        "stages": [
            {
                "stage": "贖罪バカンス",
                "energy": 180,
                "enemies": ["例のヤツ", "エリートエイリワン", "エリザベス2世", "キャプテン・モグー", "ナマルケモルル"]
            },
            {
                "stage": "プライベート熱帯雨林",
                "energy": 190,
                "enemies": ["にょろろん", "例のヤツ", "カベわんこ", "ツバメンズ", "クマンケン"]
            },
            {
                "stage": "無礼講ナイトビーチ",
                "energy": 170,
                "enemies": ["ケロ助", "例のヤツ", "ハイ・エナジー", "フルぼっこ"]
            },
            {
                "stage": "13番ホールの住人",
                "energy": 180,
                "enemies": ["ワニック", "ワニボン", "ワーニック", "ヒカル", "ゴマサーマン"]
            },
            {
                "stage": "昇天スパマッサージ",
                "energy": 190,
                "enemies": ["クロサワ監督", "リッスントゥミー", "殺意のわんこ", "イノエンジェル", "天使スレイプニール", "イカ天"]
            },
            {
                "stage": "ホテル花鳥風月",
                "energy": 220,
                "enemies": ["まゆげどり", "ド鳩・サブ・レー", "オールドリー", "大夢くん"]
            },
        ]
    },
    {
        "name": "まどいの魔道路",
        "stages": [
            {
                "stage": "毛皮をかき揚げて",
                "energy": 190,
                "enemies": ["わんこ", "にょろ", "例のヤツ", "マンボーグ鈴木", "天使ヒオコエル", "だっふんど", "天使ガブリエル"]
            },
            {
                "stage": "マーメイドのあんかけ",
                "energy": 180,
                "enemies": ["ゾンビワン", "にょろろん", "例のヤツ", "ウルトラメェメェ", "マナブくん", "ゴリ・ンジュ", "シノシシ"]
            },
            {
                "stage": "帝王の教室",
                "energy": 175,
                "enemies": ["パラサイトブンブン", "カヲルさん", "ちびぶんぶん", "レディ・ガ", "よっちゃん"]
            },
            {
                "stage": "バタバタ大黒柱",
                "energy": 200,
                "enemies": ["わんこ", "殺意のわんこ", "リッスントゥミー", "タッちゃん", "ガガガガ", "赤羅我王", "カオル君"]
            },
            {
                "stage": "潔癖症の番人",
                "energy": 180,
                "enemies": ["例のヤツ", "巨匠", "プドール夫人", "フルぼっこ", "ミニスターサイクロン", "ヨキカナ"]
            },
            {
                "stage": "絶対近視区域",
                "energy": 225,
                "enemies": ["メタルわんこ", "古代わんこ", "超メタルカバちゃん", "ダテメガネル", "メタルゴマさま"]
            },
        ]
    },
    {
        "name": "天界バル横丁",
        "stages": [
            {
                "stage": "胸騒ぎ玄関",
                "energy": 175,
                "enemies": ["わんこ", "にょろ", "ジャッキー・ペン", "サイバーX", "プドール夫人", "超町長"]
            },
            {
                "stage": "ごろ寝廊下",
                "energy": 180,
                "enemies": ["ブタヤロウ", "ダチョウ同好会", "エリザベス2世", "リッスントゥミー"]
            },
            {
                "stage": "酔いどれリビング",
                "energy": 185,
                "enemies": ["悪の帝王ニャンダム", "オオさん", "ルーパールーパー"]
            },
            {
                "stage": "きちんとキッチン",
                "energy": 190,
                "enemies": ["わんこ", "にょろ", "パオン", "カバちゃん", "ジャッキー・ペン", "ジャッキー・ペンZ", "スター・ペン", "スペースマンボルグ"]
            },
            {
                "stage": "まちぶせ風呂",
                "energy": 195,
                "enemies": ["ツバメンズ", "リッスントゥミー", "ワニック", "ヒウマ"]
            },
            {
                "stage": "子羊の寝室",
                "energy": 225,
                "enemies": ["殺意のわんこ", "カ・ンガリュ", "イルカ娘", "コアラッキョ", "ブラックブンブン"]
            },
        ]
    },
    {
        "name": "バトル銭湯",
        "stages": [
            {
                "stage": "有限会社湯気",
                "energy": 175,
                "enemies": ["ヒツギイヌ", "ヒカル", "墓手太郎", "チキランラン"]
            },
            {
                "stage": "粘り気シャワー",
                "energy": 180,
                "enemies": ["例のヤツ", "グレゴリー将軍", "エリートエイリワン", "巨匠", "カヲルさん", "ナカイくん", "リッスントゥミー"]
            },
            {
                "stage": "立ちっぱなしサウナ",
                "energy": 185,
                "enemies": ["ゾンビワン", "にょろろん", "メェメェ", "スリラーズ", "ブラッコ", "松 黒蔵", "イングリッス", "リッスントゥミー"]
            },
            {
                "stage": "冷徹水風呂",
                "energy": 190,
                "enemies": ["ゴマさま", "イノシャシ", "ナマルケモルル", "クロサワ監督", "チキランラン", "スリラーズ"]
            },
            {
                "stage": "海坊主の家",
                "energy": 195,
                "enemies": ["わんこ", "例のヤツ", "殺意のわんこ", "スリラーズ", "ハイ・エナジー", "師匠"]
            },
            {
                "stage": "デカ番台",
                "energy": 225,
                "enemies": ["天使カバちゃん", "ミスターエンジェル", "古代わんこ", "天使ガブリエル", "マンボーグ鈴木", "天使ヒオコエル", "イングリッス", "フグ太くん"]
            },
        ]
    },
    {
        "name": "はえぬき三連山",
        "stages": [
            {
                "stage": "枯れた集落",
                "energy": 190,
                "enemies": ["例のヤツ", "カバちゃん", "赤毛のにょろ", "ミニスターサイクロン", "イノシャシ"]
            },
            {
                "stage": "深爪を負った夜",
                "energy": 180,
                "enemies": ["まゆげどり", "スリラーズ", "パオン", "ハハパオン", "松 黒蔵"]
            },
            {
                "stage": "がらんどうの岩肌",
                "energy": 170,
                "enemies": ["古我王", "はぐれたヤツ", "キョセーヌ", "タッちゃん"]
            },
            {
                "stage": "過言の滝",
                "energy": 180,
                "enemies": ["わんこ", "にょろ", "例のヤツ", "サイバーX", "ドリュウ", "こぶへい"]
            },
            {
                "stage": "落とされた欲と垢",
                "energy": 200,
                "enemies": ["フグ太くん", "カルピンチョ", "ジャッキー・ペン"]
            },
            {
                "stage": "本能に従順な山伏",
                "energy": 230,
                "enemies": ["わんこ", "例のヤツ", "フルぼっこ", "リッスントゥミー", "セレブ", "だっふんど", "ゴリ・ンジュ", "ブチゴマさま", "墓手花子", "ダディ"]
            },
        ]
    },
    {
        "name": "マリン官邸",
        "stages": [
            {
                "stage": "なぎさの猛攻",
                "energy": 180,
                "enemies": ["わんこの城", "クロサワ監督", "イノシャシ", "イノヴァルカン", "イノワール", "イノエンジェル"]
            },
            {
                "stage": "不殺の釣り堀",
                "energy": 100,
                "enemies": ["ヒツギイヌ", "墓手太郎", "ブラックマ"]
            },
            {
                "stage": "トリトンの洞穴",
                "energy": 180,
                "enemies": ["メタルサイボーグ", "メタルカバちゃん", "メタルゴマさま", "チンアナ5兄弟", "ルーパールーパー"]
            },
            {
                "stage": "いさりびヘッド",
                "energy": 180,
                "enemies": ["カオル君", "赤羅我王", "メタルカオル君", "カヲルさん", "古我王"]
            },
            {
                "stage": "ブラッディ波止場",
                "energy": 210,
                "enemies": ["バトルコアラッキョ", "マンボーグ鈴木", "スペースマンボルグ"]
            },
            {
                "stage": "マルチテトラポッド",
                "energy": 240,
                "enemies": ["わんこの城", "フグ太くん"]
            },
        ]
    },
    {
        "name": "学園に巣くう悪意",
        "stages": [
            {
                "stage": "学園紛争遺跡",
                "energy": 180,
                "enemies": ["リッスントゥミー", "ガガガガ", "イングリッス", "オールドリー"]
            },
            {
                "stage": "一匹しかいない水槽",
                "energy": 180,
                "enemies": ["わんこ", "にょろ", "だっふんど", "セレブ", "ヒカル"]
            },
            {
                "stage": "購買部を牛耳る鬼",
                "energy": 190,
                "enemies": ["よっちゃん", "イルカ娘"]
            },
            {
                "stage": "校長先生の反逆",
                "energy": 190,
                "enemies": ["シャドウボクサー", "例のヤツ", "カバちゃん", "カ・ンガリュ", "キャプテン・モグー", "ゲコック", "イノシャシ", "赤井ブン太郎", "ブラックブンブン"]
            },
            {
                "stage": "鐘のマークを集めし者",
                "energy": 200,
                "enemies": ["わんこ", "にょろ", "アヒルンルン", "メェメェ", "まゆげどり", "ブラッゴリ", "大夢くん", "コアラッキョ"]
            },
            {
                "stage": "校則と罰則",
                "energy": 230,
                "enemies": ["イングリッス", "ワーニック", "古代わんこ", "ダテメガネル", "イノヴァルカン"]
            },
        ]
    },
    {
        "name": "ところてん金脈",
        "stages": [
            {
                "stage": "毛深き坑道",
                "energy": 170,
                "enemies": ["カベわんこ", "はぐれたヤツ", "悪の帝王ニャンダム", "カンバン娘", "ブラックマ"]
            },
            {
                "stage": "楽しい強制労働",
                "energy": 180,
                "enemies": ["スリラーズ", "にょろ", "メェメェ", "グレゴリー将軍", "ハハパオン", "チキランラン", "エリートエイリワン"]
            },
            {
                "stage": "ガス吸う鳥",
                "energy": 180,
                "enemies": ["メタルカバちゃん", "まゆげどり", "天使ブッタ", "天使ゴンザレス", "メタルサイボーグ"]
            },
            {
                "stage": "星々を映す地下水",
                "energy": 190,
                "enemies": ["わんこ", "にょろ", "カバちゃん", "カ・ンガリュ", "ダチョウ同好会", "ダディ", "ケロ助"]
            },
            {
                "stage": "大崩落パニック",
                "energy": 200,
                "enemies": ["ヒツギイヌ", "にょろろん", "カバタリアン", "ワニボン", "ブチゴマさま", "ヒウマ"]
            },
            {
                "stage": "スコップ一つに賭す命",
                "energy": 250,
                "enemies": ["フェンリルとウルス", "ワーニネーター", "ナカイくん"]
            },
        ]
    },
    {
        "name": "酩酊製鉄所",
        "stages": [
            {
                "stage": "プロレタリアの箱",
                "energy": 180,
                "enemies": ["イングリッス", "古代わんこ", "巨匠"]
            },
            {
                "stage": "倒れてないか見る仕事",
                "energy": 190,
                "enemies": ["メタルわんこ", "フグ太くん"]
            },
            {
                "stage": "不動のコンベア",
                "energy": 170,
                "enemies": ["超町長", "ゴマさま", "ブラッゴリ", "天使カバちゃん", "スター・ペン"]
            },
            {
                "stage": "VIP倉庫",
                "energy": 195,
                "enemies": ["ダテメガネル", "古代わんこ", "サイバーX", "デカメガネル"]
            },
            {
                "stage": "反乱スクラップ",
                "energy": 195,
                "enemies": ["リッスントゥミー", "カ・ンガリュ", "ナカイくん", "オールドリー", "コライノくん"]
            },
            {
                "stage": "天へと昇る煙突",
                "energy": 240,
                "enemies": ["タッキー", "ツバメンズ", "ダテメガネル", "古我王"]
            },
        ]
    },
    {
        "name": "暴かれし神殿の秘宝",
        "stages": [
            {
                "stage": "魔犬の遠吠え",
                "energy": 190,
                "enemies": ["わんこの城", "セレブ", "チンアナ5兄弟", "コライノくん", "イングリッス"]
            },
            {
                "stage": "犬も歩けばボーン",
                "energy": 185,
                "enemies": ["ヒツギイヌ", "シノシシ", "にょろろん", "バトルコアラッキョ"]
            },
            {
                "stage": "転んだ先の毒沼",
                "energy": 175,
                "enemies": ["教授", "まゆげどり", "イングリッス", "タッキー"]
            },
            {
                "stage": "石の上に三分",
                "energy": 180,
                "enemies": ["殺意のわんこ", "ミニスターサイクロン", "ヒカル", "ドリュウ"]
            },
            {
                "stage": "乗りかかった泥船",
                "energy": 200,
                "enemies": ["ワーニネーター", "真レジェンドブンブン"]
            },
            {
                "stage": "ミイラトリガーミイラ",
                "energy": 240,
                "enemies": ["マンボーグ鈴木", "スリラーズ", "古代わんこ", "ブラッコ", "ちびぶんぶん", "イルカ娘"]
            },
        ]
    },
    {
        "name": "帝政エイジャナイカ",
        "stages": [
            {
                "stage": "権力と万有引力",
                "energy": 170,
                "enemies": ["リッスントゥミー", "ド鳩・サブ・レー", "にょろ", "ガガガガ", "コアラッキョ", "ダチョウ同好会"]
            },
            {
                "stage": "エナジー奴隷",
                "energy": 180,
                "enemies": ["ナマルケモルル", "カベわんこ", "キョセーヌ", "殺意のわんこ", "ブラッゴリ", "ブラッコ"]
            },
            {
                "stage": "民の手の松明",
                "energy": 180,
                "enemies": ["エリートエイリワン", "ワーニック", "サイバーX", "キャプテン・モグー", "カヲルさん", "イノヴァルカン", "マナブくん", "ゲコック", "ギャラクシーニャンダム"]
            },
            {
                "stage": "アットホーム恐怖政治",
                "energy": 190,
                "enemies": ["ド鳩・サブ・レー", "まゆげどり", "赤井ブン太郎", "ぶんぶん先生", "オオさん", "ブラックブンブン"]
            },
            {
                "stage": "無断呼吸禁止法",
                "energy": 200,
                "enemies": ["ゾンビワン", "ヒツギイヌ", "トンシー", "スリラーズ", "スカルボクサー", "キャベロン", "墓手太郎"]
            },
            {
                "stage": "玉座に牙むく群衆",
                "energy": 250,
                "enemies": ["ミスターエンジェル", "天使ゴンザレス", "天使ガブリエル", "古代わんこ", "天使ヒオコエル", "超町長", "天使ドーヴエル"]
            },
        ]
    },
    {
        "name": "鋼鉄スポーツジム",
        "stages": [
            {
                "stage": "人力ルームランナー",
                "energy": 185,
                "enemies": ["わんこの城", "ウサ銀", "ハサミーマン", "ワーニック", "エリザベス56世", "クマンチュー", "イノシャシ", "一角くん", "イノヴァルカン", "ヤドカリー"]
            },
            {
                "stage": "倍返しサンドバッグ",
                "energy": 100,
                "enemies": ["ブラックマ", "ブラッコ", "殺意のわんこ"]
            },
            {
                "stage": "プロテイン粉末吸引",
                "energy": 175,
                "enemies": ["ヒウマ", "タッキー"]
            },
            {
                "stage": "無酸素エアロバイク",
                "energy": 185,
                "enemies": ["イングリッス", "リッスントゥミー", "コライノくん", "ミニアンデッドサイクロン"]
            },
            {
                "stage": "逆立ちサウナ",
                "energy": 205,
                "enemies": ["天使ドーヴエル", "ケロ助", "例のヤツ"]
            },
            {
                "stage": "レイクサイドブートキャンプ",
                "energy": 250,
                "enemies": ["殺意のわんこ", "ミスターエンジェル", "リッスントゥミー", "赤毛のにょろ", "ワーニック", "メタルコアラッキョ"]
            },
        ]
    },
    {
        "name": "明星おきの島",
        "stages": [
            {
                "stage": "カレー彗星",
                "energy": 180,
                "enemies": ["フグ太くん", "イルカ娘", "ナカイくん"]
            },
            {
                "stage": "イカロスの本能",
                "energy": 190,
                "enemies": ["ワーニネーター", "イノエンジェル", "ブラックブンブン", "イノシャシ", "ぶんぶん先生"]
            },
            {
                "stage": "虹の橋の通行料",
                "energy": 180,
                "enemies": ["ナカイくん", "ハイ・エナジー", "ジョン・レオン", "天使スレイプニール", "はぐれたヤツ"]
            },
            {
                "stage": "プラネタリウムラブ",
                "energy": 190,
                "enemies": ["メタルゴマさま", "ダテメガネル", "メタルサイボーグ", "わんこ"]
            },
            {
                "stage": "流星大踊り",
                "energy": 200,
                "enemies": ["例のヤツ", "ゴリさん", "メタルコアラッキョ", "ナマルケモルル", "フグ太くん"]
            },
            {
                "stage": "星座になったネコども",
                "energy": 250,
                "enemies": ["古代砲", "ブラッゴリ", "殺意のわんこ", "シャドウボクサー", "イノワール", "松 黒蔵"]
            },
        ]
    },
    {
        "name": "眠れる森の何か",
        "stages": [
            {
                "stage": "王子様の出てくる森",
                "energy": 200,
                "enemies": ["古代砲", "まゆげどり", "ちびぶんぶん", "ぶんぶん先生"]
            },
            {
                "stage": "歌うま姫の家",
                "energy": 180,
                "enemies": ["わんこの城", "殺意のわんこ", "イングリッス", "古代わんこ", "オールドリー"]
            },
            {
                "stage": "邪悪な美魔女の城",
                "energy": 190,
                "enemies": ["古代砲", "パラサイトブンブン", "イノシャシ", "コライノくん"]
            },
            {
                "stage": "ガラスの靴下",
                "energy": 190,
                "enemies": ["わんこの城", "ワーニック", "クマンチュー", "破壊生物クオリネン", "チンアナ5兄弟", "ダチョウ同好会"]
            },
            {
                "stage": "仮面武道会",
                "energy": 180,
                "enemies": ["古代砲", "天使ガブリエル", "赤毛のにょろ", "天使ドーヴエル", "教授"]
            },
            {
                "stage": "幸せに暮らしました",
                "energy": 250,
                "enemies": ["烈波砲", "イングリッス", "ダテメガネル", "セレブ", "師匠", "ドリュウ"]
            },
        ]
    },
    {
        "name": "ラボラ・トリ島",
        "stages": [
            {
                "stage": "フラスコ岳",
                "energy": 180,
                "enemies": ["ウサ銀", "レディ・ガ", "ウルトラメェメェ", "グレゴリー将軍", "一角くん", "ジョン・レオン", "大夢くん", "アルパッカ"]
            },
            {
                "stage": "人体模型林",
                "energy": 190,
                "enemies": ["リッスントゥミー", "ド鳩・サブ・レー", "アヒルンルン", "タッキー", "コアラッキョ", "ダディ"]
            },
            {
                "stage": "ホルマリンマリーナ",
                "energy": 180,
                "enemies": ["烈波砲", "ウルトラメェメェ", "ハハパオン", "スター・ペン", "マナブくん", "グレゴリー将軍", "ゲコック", "巨匠"]
            },
            {
                "stage": "知識に溺れる者の沼",
                "energy": 190,
                "enemies": ["ウサ銀", "キョセーヌ", "バトルコアラッキョ", "タッちゃん", "ヒウマ"]
            },
            {
                "stage": "プレパラートの橋",
                "energy": 200,
                "enemies": ["ゾンビワン", "天使ガブリエル", "にょろろん", "ジャッキー・ペンZ", "ミニアンデッドサイクロン", "天使ゴンザレス", "天使ドーヴエル"]
            },
            {
                "stage": "炎上する青",
                "energy": 250,
                "enemies": ["烈波砲", "古代わんこ", "メタルサイボーグ", "ワーニネーター", "カ・ンガリュ", "メタルわんこ", "ドリュウ", "メタルコアラッキョ"]
            },
        ]
    },
    {
        "name": "忘らるる墓所",
        "stages": [
            {
                "stage": "眠りの洞穴",
                "energy": 190,
                "enemies": ["ヒツギイヌ", "古我王", "オオさん", "古代わんこ", "ブチゴマさま"]
            },
            {
                "stage": "こぢんまり故人",
                "energy": 180,
                "enemies": ["殺意のわんこ", "ワニボン", "コライノくん", "キャベロン"]
            },
            {
                "stage": "死者のセカンドライフ",
                "energy": 200,
                "enemies": ["イングリッス", "アヒルンルン", "ダテメガネル", "墓手太郎", "墓手花子"]
            },
            {
                "stage": "荒らされた墓石",
                "energy": 180,
                "enemies": ["赤毛のにょろ", "ゴマさま", "ミニアンデッドサイクロン", "天使ガブリエル", "フグ太くん", "クマンケン"]
            },
            {
                "stage": "ボタニカル埋葬",
                "energy": 190,
                "enemies": ["古代わんこ", "シャドウボクサー", "ジョン・レオン", "超町長"]
            },
            {
                "stage": "骨身にしみる水",
                "energy": 250,
                "enemies": ["オールドリー", "テバムラサキホネツバメ", "ガガガガ", "イングリッス"]
            },
        ]
    },
    {
        "name": "始まりを告げる朝",
        "stages": [
            {
                "stage": "忠誠の祈り",
                "energy": 180,
                "enemies": ["ワーニネーター", "テバムラサキホネツバメ", "天使ドーヴエル"]
            },
            {
                "stage": "生誕のジレンマ",
                "energy": 190,
                "enemies": ["マナブくん", "タッキー", "フグ太くん"]
            },
            {
                "stage": "白の神託",
                "energy": 180,
                "enemies": ["ルーパールーパー", "ジョン・レオン", "チキランラン"]
            },
            {
                "stage": "ペルソナの芽生え",
                "energy": 190,
                "enemies": ["ミニスターサイクロン", "チンアナ5兄弟", "メタルコアラッキョ"]
            },
            {
                "stage": "リビドーの解放",
                "energy": 210,
                "enemies": ["殺意のわんこ", "フルぼっこ", "ミニアンデッドサイクロン", "オールドリー", "ヒウマ"]
            },
            {
                "stage": "深層に眠る偽善",
                "energy": 260,
                "enemies": ["ゾンビワン", "エリートエイリワン", "ゲコック", "スター・ペン", "古我王", "シノシシ"]
            },
        ]
    },
    {
        "name": "ハッピーラッキー寺院",
        "stages": [
            {
                "stage": "煽ってくる巡礼者",
                "energy": 180,
                "enemies": ["超メタルカバちゃん", "はぐれたヤツ", "トンシー", "ヨキカナ", "ハイ・エナジー", "ドリュウ"]
            },
            {
                "stage": "大遅刻プリースト",
                "energy": 190,
                "enemies": ["ゴマサーマン", "カバタリアン", "オールドリー", "教授", "マンボーグ鈴木", "ケロ助"]
            },
            {
                "stage": "コーラスラップバトル",
                "energy": 210,
                "enemies": ["ミスターエンジェル", "ワニボン", "よっちゃん", "天使ブッタ", "デカメガネル"]
            },
            {
                "stage": "冒険の書に記録",
                "energy": 190,
                "enemies": ["ブチゴマさま", "レディ・ガ", "ヒカル", "カヲルさん", "天使ヒオコエル"]
            },
            {
                "stage": "転送型チャペル",
                "energy": 180,
                "enemies": ["エリートエイリワン", "スター・ペン", "キャプテン・モグー", "大夢くん", "巨匠", "ミニスターサイクロン", "ゲコック"]
            },
            {
                "stage": "邪神様のお告げ",
                "energy": 260,
                "enemies": ["タッキー", "テバムラサキホネツバメ"]
            },
        ]
    },
    {
        "name": "キネマ怪館",
        "stages": [
            {
                "stage": "らせん状リング",
                "energy": 210,
                "enemies": ["古代砲", "ウサ銀", "エリザベス2世", "赤毛のにょろ", "悪の帝王ニャンダム", "教授", "イノシャシ"]
            },
            {
                "stage": "13日の給料日",
                "energy": 190,
                "enemies": ["古代砲", "殺意のわんこ", "ブラッコ", "ブラックブンブン", "タッちゃん"]
            },
            {
                "stage": "ノーマル・アクティビティ",
                "energy": 180,
                "enemies": ["古代砲", "ド鳩・サブ・レー", "パラサイトブンブン", "超町長", "ツバメンズ"]
            },
            {
                "stage": "ほんのり黒い家",
                "energy": 190,
                "enemies": ["古代砲", "天使ガブリエル", "天使ゴンザレス", "ミスターエンジェル", "イカ天", "天使スレイプニール"]
            },
            {
                "stage": "冷静スクリーム",
                "energy": 180,
                "enemies": ["古代砲", "ヒツギイヌ", "ゴリ・ンジュ", "スリラーズ", "ミニアンデッドサイクロン", "スカルボクサー", "キャベロン"]
            },
            {
                "stage": "はらわたの史料室",
                "energy": 260,
                "enemies": ["古代砲", "ウリボーイ", "セレブ", "ナマルケモルル", "ダチョウ同好会"]
            },
        ]
    },
    {
        "name": "ダイバー都市",
        "stages": [
            {
                "stage": "多様性とアルカリ性",
                "energy": 190,
                "enemies": ["メタルわんこ", "天使ガブリエル", "天使ゴンザレス", "メタルサイボーグ", "天使ドーヴエル"]
            },
            {
                "stage": "砂鉄海浜公園",
                "energy": 190,
                "enemies": ["例のヤツ", "メタルゴマさま", "ヒウマ", "ブラッゴリ", "ブラッコ", "ミスターエンジェル", "天使ゴンザレス", "スリラーズ", "ゴリ・ンジュ"]
            },
            {
                "stage": "油の虹",
                "energy": 180,
                "enemies": ["ジャッキー・ペンZ", "チキランラン", "メタルカバちゃん", "テバムラサキホネツバメ", "超メタルカバちゃん", "墓手太郎"]
            },
            {
                "stage": "恋愛コンビナート",
                "energy": 210,
                "enemies": ["ワニック", "ウリボーイ", "メタルコアラッキョ", "パオン", "ゴマさま"]
            },
            {
                "stage": "夜景残業問題",
                "energy": 180,
                "enemies": ["ワーニネーター", "クロサワ監督", "メタルカオル君"]
            },
            {
                "stage": "ブラウン管のインフルエンサー",
                "energy": 260,
                "enemies": ["メタルわんこ", "メタルカバちゃん", "ごん兵衛"]
            },
        ]
    },
    {
        "name": "ナシゴ・レン",
        "stages": [
            {
                "stage": "アンコールS.W.A.T",
                "energy": 190,
                "enemies": ["烈波砲", "フグ太くん", "オオさん"]
            },
            {
                "stage": "熱帯チョコバナナ園",
                "energy": 180,
                "enemies": ["わんこの城", "イノワール", "超町長"]
            },
            {
                "stage": "クアラルン池",
                "energy": 190,
                "enemies": ["イングリッス", "ごん兵衛", "こぶへい"]
            },
            {
                "stage": "ポイズンチキンライス",
                "energy": 180,
                "enemies": ["コライノくん", "タッキー"]
            },
            {
                "stage": "燃えるカオマンガイ",
                "energy": 210,
                "enemies": ["ガガガガ", "真レジェンドブンブン"]
            },
            {
                "stage": "魚足魅惑のマーメイド",
                "energy": 260,
                "enemies": ["マーさん", "殺意のわんこ", "イカ天", "スペースマンボルグ"]
            },
        ]
    },
    {
        "name": "DNA果樹園",
        "stages": [
            {
                "stage": "ゲノムバナナ狩り",
                "energy": 180,
                "enemies": ["プドール夫人", "大夢くん", "天使スレイプニール", "天使ガブリエル"]
            },
            {
                "stage": "偽いちごハウス",
                "energy": 190,
                "enemies": ["ミニアンデッドサイクロン", "ミニスターサイクロン", "ギャラクシーニャンダム"]
            },
            {
                "stage": "無農薬で造った染色体",
                "energy": 190,
                "enemies": ["ジョン・レオン", "ごん兵衛", "天使ガブリエル", "ゾンビワン"]
            },
            {
                "stage": "食べごろナノぶどう",
                "energy": 180,
                "enemies": ["ワーニネーター", "にょろろん", "天使カバちゃん", "クマンケン"]
            },
            {
                "stage": "クローン農夫",
                "energy": 210,
                "enemies": ["マーさん", "セレブ", "ダチョウ同好会", "ヒカル"]
            },
            {
                "stage": "遺伝子情報直売所",
                "energy": 260,
                "enemies": ["怒りのブラッゴリ", "殺意のわんこ", "ヒウマ", "テバムラサキホネツバメ"]
            },
        ]
    },
    {
        "name": "古代樹の迷宮",
        "stages": [
            {
                "stage": "蔦に閉ざされた扉",
                "energy": 185,
                "enemies": ["烈波砲", "松 黒蔵", "殺意のわんこ", "怒りのブラッゴリ", "ブラックマ", "キョセーヌ"]
            },
            {
                "stage": "輪廻を表す年輪",
                "energy": 200,
                "enemies": ["烈波砲", "一角くん", "赤毛のにょろ", "ナカイくん", "教授", "ケロ助"]
            },
            {
                "stage": "レ・リーフの双塔",
                "energy": 185,
                "enemies": ["烈波砲", "例のヤツ", "ワーニック", "メタルわんこ", "超メタルカバちゃん", "巨匠", "メタルゴマさま"]
            },
            {
                "stage": "樹冠の祭壇",
                "energy": 190,
                "enemies": ["烈波砲", "古代わんこ", "ごん兵衛", "ちびぶんぶん", "天使ドーヴエル"]
            },
            {
                "stage": "樹液の湧き出る地下道",
                "energy": 190,
                "enemies": ["烈波砲", "スリラーズ", "カルピンチョ", "テバムラサキホネツバメ", "墓手花子", "チキランラン", "ゴマさま"]
            },
            {
                "stage": "神の面を賜りし者",
                "energy": 260,
                "enemies": ["古神炎ドロン", "まゆげどり", "ナマルケモルル", "ワーニネーター", "怒りのブラッゴリ"]
            },
        ]
    },
    {
        "name": "立ちはだかる者達の城",
        "stages": [
            {
                "stage": "気高き暴君との対決",
                "energy": 200,
                "enemies": ["フグ太くん", "破壊生物クオリネン", "ぶんぶん先生"]
            },
            {
                "stage": "天変地異の局面",
                "energy": 185,
                "enemies": ["マーさん", "ドリュウ", "ダディ", "イノエンジェル", "イカ天", "マンボーグ鈴木"]
            },
            {
                "stage": "極悪三兄弟とのデュエル",
                "energy": 185,
                "enemies": ["コアラッキョ", "メタルコアラッキョ", "バトルコアラッキョ"]
            },
            {
                "stage": "寸止め打撃対戦",
                "energy": 190,
                "enemies": ["イカ天", "赤井ブン太郎", "超町長", "天使ブッタ"]
            },
            {
                "stage": "あの世とこの世の境界線",
                "energy": 200,
                "enemies": ["ジョン・レオン", "キャベロン", "イノワール", "天使スレイプニール", "シノシシ"]
            },
            {
                "stage": "四皇帝の殿堂",
                "energy": 250,
                "enemies": ["ブラックマ", "カンバン娘", "天使ドーヴエル", "オールドリー", "ヨキカナ"]
            },
        ]
    },
    {
        "name": "時空のゆがみ",
        "stages": [
            {
                "stage": "大脱獄",
                "energy": 180,
                "enemies": ["例のヤツ", "リッスントゥミー", "デビルワン", "ダチョウ同好会", "シャドウボクサー", "イノシャシ", "ウルフとウルルン", "ブラックマ"]
            },
            {
                "stage": "赤いきつねの愚者",
                "energy": 185,
                "enemies": ["ぶんぶん先生", "メタルわんこ", "天使カバちゃん", "松 黒蔵", "はぐれたヤツ", "赤羅我王", "デビルワン", "コニャンダム", "カベわんこ"]
            },
            {
                "stage": "おぼえたての悪",
                "energy": 190,
                "enemies": ["デビルワン", "例のヤツ", "わんこずきんミーニャ", "ハイ・エナジー", "はぐれたヤツ", "マンボーグ鈴木", "殺意のわんこ", "松 黒蔵", "ツバメンズ", "ブラックマ"]
            },
            {
                "stage": "ウニデーモンスタジオ",
                "energy": 190,
                "enemies": ["わんこの城", "犬武者 武蔵", "ゾンビワン", "ワニボン", "ワニック", "例のヤツ", "ゴリ・ンジュ", "ブチゴマさま", "スカルボクサー", "デビルワン"]
            },
            {
                "stage": "太古の魔力",
                "energy": 200,
                "enemies": ["ちびぶんぶん", "わんこ", "にょろ", "例のヤツ", "天使ガブリエル", "殺意のわんこ", "ワニック", "赤毛のにょろ", "デビルワン", "レジェンドブンブンΩ"]
            },
            {
                "stage": "サタンオールスターズ",
                "energy": 260,
                "enemies": ["ウルフとウルルン", "コニャンダム", "わんこずきんミーニャ", "犬武者 武蔵", "レジェンドブンブンΩ", "デビルワン", "ウサ銀", "ジャッキー・ペン"]
            },
        ]
    },
    {
        "name": "大厄災のはじまり",
        "stages": [
            {
                "stage": "悪魔城の封印",
                "energy": 200,
                "enemies": ["悪魔城", "古代わんこ", "デビルワン", "真レジェンドブンブン", "カンバン娘"]
            },
        ]
    },
    {
        "name": "魔海域ビックラ港",
        "stages": [
            {
                "stage": "ポンポン船の墓場",
                "energy": 180,
                "enemies": ["シスターデビル", "オオさん", "悪魔ベヒモッス"]
            },
            {
                "stage": "壮絶な荒波",
                "energy": 195,
                "enemies": ["インフェルにょろ", "ウサ銀", "まゆげどり", "マデューさん", "ごん兵衛"]
            },
            {
                "stage": "とれたて干物市",
                "energy": 185,
                "enemies": ["古我王", "ギルティ・ペン", "古代わんこ", "天使ガブリエル", "テバムラサキホネツバメ", "殺意のわんこ"]
            },
            {
                "stage": "防波堤の血戦",
                "energy": 200,
                "enemies": ["悪魔城", "悪の帝王ニャンダム", "ケルベローズ", "デビルワン", "ヘルゴリラー", "大夢くん", "イングリッス", "ダテメガネル"]
            },
            {
                "stage": "漁業組合の反乱",
                "energy": 190,
                "enemies": ["悪魔城", "シスターデビル", "セレブ", "フグ太くん", "アックマ閣下"]
            },
            {
                "stage": "網にかかりしオトシゴ",
                "energy": 260,
                "enemies": ["悪魔城", "デビルワン", "ヘルゴリラー", "ジョン・レオン", "デビルカツヤ"]
            },
        ]
    },
    {
        "name": "デッドヒートランド",
        "stages": [
            {
                "stage": "マグマシャフト",
                "energy": 180,
                "enemies": ["魔我王", "ウルトラメェメェ", "ブタヤロウ", "ヘルゴリラー"]
            },
            {
                "stage": "焼ける赤土",
                "energy": 190,
                "enemies": ["インフェルにょろ", "天使カバちゃん", "デスコアラッキョ", "イノエンジェル"]
            },
            {
                "stage": "血の池沸騰",
                "energy": 200,
                "enemies": ["デビルカツヤ", "こぶへい", "デビルワン"]
            },
            {
                "stage": "ヘルズクレーター",
                "energy": 200,
                "enemies": ["ケルベローズ", "スリラーズ", "ゴリ・ンジュ", "シノシシ", "マデューさん"]
            },
            {
                "stage": "火の国ダイ=ナマイト",
                "energy": 180,
                "enemies": ["古代砲", "悪の帝王ニャンダム", "ミッドナイトナカイ", "殺意のわんこ", "クロサワ監督"]
            },
            {
                "stage": "たそがれに燃える丘",
                "energy": 260,
                "enemies": ["デビルワン", "アックマ閣下", "レッド・エナG", "ヒウマ", "悪魔ベヒモッス"]
            },
        ]
    },
    {
        "name": "バラ色の袋小路",
        "stages": [
            {
                "stage": "モノ言わぬ舌",
                "energy": 190,
                "enemies": ["エイリワン", "スペースマンボルグ", "キャプテン・モグー", "カーバチャン", "スカルボクサー"]
            },
            {
                "stage": "ランプを手にした群衆",
                "energy": 200,
                "enemies": ["はぐれたヤツ", "イングリッス", "怒りのブラッゴリ", "ダテメガネル", "ヒカル"]
            },
            {
                "stage": "一寸先は炭",
                "energy": 180,
                "enemies": ["レッド・エナG", "ブラックマ"]
            },
            {
                "stage": "権力者の隠れミノ",
                "energy": 180,
                "enemies": ["メタルわんこ", "タッキー", "メタルカバちゃん", "メタルゴマさま"]
            },
            {
                "stage": "晩餐の館",
                "energy": 200,
                "enemies": ["ミスターエンジェル", "ド鳩・サブ・レー", "スリラーズ", "チキランラン", "シスターデビル", "天使ガブリエル", "天使ヒオコエル", "天使ブッタ"]
            },
            {
                "stage": "焼肉焼いても街焼くな",
                "energy": 260,
                "enemies": ["烈波砲", "師匠", "クマンチュー", "ダチョウ同好会", "パラサイトブンブン", "カルピンチョ"]
            },
        ]
    },
    {
        "name": "千年獣の霊峰",
        "stages": [
            {
                "stage": "霧散した記憶の泉",
                "energy": 180,
                "enemies": ["破壊生物クオリネン", "マーさん", "シスターデビル", "ワニボン", "デビルワン", "ケルベローズ"]
            },
            {
                "stage": "無秩序な鼓動",
                "energy": 210,
                "enemies": ["デビルワン", "ケルベローズ", "アックマ閣下", "魔我王"]
            },
            {
                "stage": "霞む視界の先には",
                "energy": 180,
                "enemies": ["殺意のわんこ", "ギルティ・ペン", "オールドリー"]
            },
            {
                "stage": "隣り合う冥土",
                "energy": 190,
                "enemies": ["はぐれたヤツ", "ワニボン", "ゴリ・ンジュ", "ハサミーマン", "レッド・エナG", "墓手太郎"]
            },
            {
                "stage": "銀色清流",
                "energy": 190,
                "enemies": ["例のヤツ", "コライノくん", "古代わんこ", "ウルトラメェメェ", "超町長", "イングリッス", "キョセーヌ", "大夢くん"]
            },
            {
                "stage": "天寿を授ける頂",
                "energy": 260,
                "enemies": ["まゆげどり", "赤毛のにょろ", "超古獣ナーラ", "デビルワン", "天使ゴンザレス"]
            },
        ]
    },
    {
        "name": "ムーディストビーチ",
        "stages": [
            {
                "stage": "星降るウイスキーグラス",
                "energy": 210,
                "enemies": ["エリートエイリワン", "スター・ペン", "グレゴリー将軍", "ゲコック", "天使ドーヴエル", "チンアナ5兄弟"]
            },
            {
                "stage": "ボッタクリにむせぶ夜",
                "energy": 160,
                "enemies": ["カオル君", "リッスントゥミー", "ツバメンズ", "メタルカオル君", "テバムラサキホネツバメ", "パラサイトブンブン", "カンバン娘"]
            },
            {
                "stage": "急がないで傍にいて～慕情～",
                "energy": 210,
                "enemies": ["ブラックブンブン", "赤井ブン太郎", "ぶんぶん先生", "トロリンチョ", "ヒツギイヌ"]
            },
            {
                "stage": "涙にぬれた子犬よ",
                "energy": 160,
                "enemies": ["リッスントゥミー", "ちびわんこ", "ケルベローズ", "例のヤツ", "スリラーズ", "テバムラサキホネツバメ"]
            },
            {
                "stage": "忍び遭い",
                "energy": 100,
                "enemies": ["殺意のわんこ", "古代わんこ", "セレブ", "イングリッス", "わんこ", "ブラックマ"]
            },
            {
                "stage": "いにしえ深海ブルース",
                "energy": 280,
                "enemies": ["古兵器マンボロス", "オオウサ銀", "ちびわんこ", "ヨキカナ"]
            },
        ]
    },
    {
        "name": "猫追いしふるさと",
        "stages": [
            {
                "stage": "竪穴式校舎",
                "energy":210,
                "enemies": ["イングリッス","リッスントゥミー","ケロ助","オールドリー","ダテメガネル"]
            },
            {
                "stage": "収穫を占う地方放送",
                "energy":180,
                "enemies": ["古代わんこ","ちびわんこ","ちびぶんぶん","ガガガガ","古我王","超町長"]
            },
            {
                "stage": "火焔型土器でおふくろの味",
                "energy":200,
                "enemies": ["古代わんこ","ケルベローズ","ヘルゴリラー","コライノくん","悪魔ベヒモッス"]
            },
            {
                "stage": "豪族の集う喫煙所",
                "energy":180,
                "enemies": ["イングリッス","フグ太くん","オオウサ銀","ダテメガネル","ダディ"]
            },
            {
                "stage": "生贄探して道の駅",
                "energy":200,
                "enemies": ["古代わんこ","例のヤツ","怒りのブラッゴリ","イングリッス","ぶんぶん先生","古兵器マンボロス"]
            },
            {
                "stage": "おらこんな故郷でるだ",
                "energy":260,
                "enemies": ["ハニワンワン","ギャラクシーニャンダム","ダテメガネル","フグ太くん"]
            }
        ]
    },
    {
        "name": "海賊王商店街",
        "stages": [
            {
                "stage": "理容ももの毛姫",
                "energy": 180,
                "enemies": ["古代砲", "はぐれたヤツ", "セレブ", "ウリボーイ", "ハニワンワン", "古代わんこ", "マーさん"]
            },
            {
                "stage": "スタンバイ民宿",
                "energy": 180,
                "enemies": ["わんこの城", "デビルワン", "ヘルゴリラー", "コライノくん", "ミッドナイトナカイ"]
            },
            {
                "stage": "アベン・ジャズ喫茶",
                "energy": 200,
                "enemies": ["イングリッス", "ハニワンワン", "ガガガガ", "よっちゃん", "真レジェンドブンブン", "アルパッカ"]
            },
            {
                "stage": "ばたり庵",
                "energy": 210,
                "enemies": ["烈波砲", "古代わんこ", "スカルボクサー", "トロリンチョ", "古兵器マンボロス"]
            },
            {
                "stage": "タイタ肉屋",
                "energy": 200,
                "enemies": ["ケルベローズ", "古代わんこ", "デビルワン", "デスコアラッキョ", "超町長", "デビルカツヤ"]
            },
            {
                "stage": "イン・デペンデンス亭",
                "energy": 260,
                "enemies": ["古代砲", "大天使チビネル", "例のヤツ", "殺意のわんこ", "ジョン・レオン", "オオウサ銀", "オールドリー"]
            },
        ]
    },
    {
        "name": "真なる虚実を紡ぐ道",
        "stages": [
            {
                "stage": "ピリオド大渓谷",
                "energy": 200,
                "enemies": ["にょろろん", "古代わんこ", "ダテメガネル", "シャドウボクサー", "ブラックブンブン", "超町長", "クマンケン"]
            },
            {
                "stage": "暗い魔窟の主",
                "energy": 180,
                "enemies": ["メタルわんこ", "プドール夫人", "メタルゴマさま", "ダテメガネル", "イングリッス", "破壊生物クオリネン"]
            },
            {
                "stage": "斜陽の警告",
                "energy": 190,
                "enemies": ["ハニワンワン", "古代わんこ", "キャプテン・モグー", "ルーパールーパー", "オールドリー"]
            },
            {
                "stage": "インフィニ峠",
                "energy": 200,
                "enemies": ["古代わんこ", "ウサ銀", "ウルトラメェメェ", "グレゴリー将軍", "コライノくん", "大天使チビネル", "レッド・エナG"]
            },
            {
                "stage": "エターナル古森林",
                "energy": 210,
                "enemies": ["ケルベローズ", "イングリッス", "ハニワンワン", "ギルティ・ペン", "古代わんこ", "シスターデビル", "ミッドナイトナカイ", "古兵器マンボロス", "超町長", "ガガガガ"]
            },
            {
                "stage": "はじまりへ続く足跡",
                "energy": 280,
                "enemies": ["古我王", "はぐれたヤツ", "イングリッス", "野生のわんこ", "ちびわんこ", "大天使チビネル", "真レジェンドブンブン", "ゴマさま", "セレブ"]
            },
        ]
    },
    {
        "name": "人類ネコ化計画",
        "stages": [
            {
                "stage": "偶像に宿る魂",
                "energy": 200,
                "enemies": ["ちびわんこ", "メタルわんこ", "カ・ンガリュ", "メタルカバちゃん", "土偶戦士ドグ丸", "ヘルゴリラー", "ヒウマ"]
            },
            {
                "stage": "名誉一つに賭す命",
                "energy": 200,
                "enemies": ["殺意のわんこ", "怒りのブラッゴリ", "フェンリルとウルス", "フグ太くん", "ケロ助", "ダテメガネル"]
            },
            {
                "stage": "虚栄の冠を賜りし者",
                "energy": 200,
                "enemies": ["天使ガブリエル", "イングリッス", "セレブ", "古神炎ドロン", "マンボーグ鈴木", "超町長"]
            },
            {
                "stage": "永久を授ける頂",
                "energy": 200,
                "enemies": ["野生のわんこ", "ケルベローズ", "ヘルゴリラー", "カ・ンガリュ", "超古獣ナーラ", "デビルカツヤ"]
            },
            {
                "stage": "原罪を贖いし時",
                "energy": 250,
                "enemies": ["ウサ銀", "土偶戦士ドグ丸", "ゴマさま", "野生のわんこ", "フェンリルとウルス", "古神炎ドロン", "超古獣ナーラ"]
            },
            {
                "stage": "古代を統べる猿人",
                "energy": 230,
                "enemies": ["殺意のわんこ", "ハニワンワン", "怒りのブラッゴリ", "ダテメガネル", "超闇獣ダックジョー", "超猿獣ルーザ"]
            },
            {
                "stage": "逆襲の大猿人",
                "energy": 240,
                "enemies": ["例のヤツ", "超猿獣ルーザ", "超爆獣アリアント", "リッスントゥミー", "野生のわんこ", "超翼獣ピヨルーツ", "はぐれたヤツ"]
            },
            {
                "stage": "真人類創生",
                "energy": 250,
                "enemies": ["野生のわんこ", "ちびわんこ", "まゆげどり", "古代わんこ", "超竜獣オウルハズク", "超猿獣ルーザ"]
            },
        ]
    },
    {
        "name": "古代神樹",
        "stages": [
            {
                "stage": "起源の覚醒",
                "energy": 300,
                "enemies": ["超生命体ゼロルーザ", "リッスントゥミー", "イングリッス", "古代わんこ", "野生のわんこ", "ウリボーイ", "セレブ"]
            },
        ]
    },
];

const enemies=[];

    for(const chapter of chapters){
        for(const stage of chapter.stages){
            for(const enemy of stage.enemies){
                if(!enemies.includes(enemy)){
                    enemies.push(enemy);
                }
            }
        }
    }

const yomi = {
    "古代わんこ":"こだいわんこ",
    "真レジェンドぶんぶん":"しんれじぇんどぶんぶん",
    "例のヤツ":"れいのやつ",
    "超メタルカバちゃん":"ちょうめたるかばちゃん",
    "師匠":"ししょう",
    "悪の帝王ニャンダム":"あくのていおうにゃんだむ",
    "教授":"きょうじゅ",
    "赤毛のにょろ":"あかげのにょろ",
    "天使ガブリエル":"てんしがぶりえる",
    "天使ブッタ":"てんしぶった",
    "一角くん":"いっかくくん",
    "悪魔ベヒモッス":"あくまべひもっす",
    "巨匠":"きょしょう",
    "犬武者 武蔵":"いぬむしゃ むさし",
    "古我王":"こがおう",
    "古神炎ドロン":"こじんえんどろん",
    "殺意のわんこ":"さついのわんこ",
    "古兵器マンボロス":"こへいきまんぼろす",
    "松 黒蔵":"まつ くろぞう",
    "真レジェンドブンブン":"しんれじぇんどぶんぶん",
    "赤井ブン太郎":"あかいぶんたろう",
    "赤羅我王":"あからがおう",
    "大天使チビネル":"だいてんしちびねる",
    "大夢くん":"おおむくん",
    "超闇獣ダックジョー":"ちょうあんじゅうだっくじょー",
    "超猿獣ルーザ":"ちょうえんじゅうるーざ",
    "超古獣ナーラ":"ちょうこじゅうなーら",
    "超生命体ゼロルーザ":"ちょうせいめいたいぜろるーざ",
    "超町長":"ちょうちょうちょう",
    "超爆獣アリアント":"ちょうばくじゅうありあんと",
    "超翼獣ピヨルーツ":"ちょうよくじゅうぴよるーつ",
    "超竜獣オウルハズク":"ちょうりゅうじゅうおうるはずく",
    "天使ゴンザレス":"てんしごんざれす",
    "天使カバちゃん":"てんしかばちゃん",
    "天使スレイプニール":"てんしすれいぷにーる",
    "天使ドーヴエル":"てんしどーヴえる",
    "天使ヒオコエル":"てんしひおこえる",
    "土偶戦士ドグ丸":"どぐうせんしどぐまる",
    "怒りのブラッゴリ":"いかりのぶらっごり",
    "破壊生物クオリネン":"はかいせいぶつくおりねん",
    "墓手花子":"はかてはなこ",
    "墓手太郎":"はかてたろう",
    "魔我王":"まがおう",
    "野生のわんこ":"やせいのわんこ"
};

/*敵を順番に*/
enemies.sort((a,b)=>{
    const youmiA = yomi[a] || a;
    const youmiB = yomi[b] || b;
    return youmiA.localeCompare(youmiB,"ja");
});


/* 選択肢の追加 */
const boxes = document.querySelectorAll(".box");

for(const box of boxes){
    for(const enemy of enemies){
        box.innerHTML += 
        `<option value="${enemy}">
           ${enemy}
        </option>`;
    }
}